[
    {
        "title": "[iOSDC Japan 2024] Retrospective by KINTO Technologies",
        "pubDate": "2024-11-12 10:00:00",
        "link": "https://blog.kinto-technologies.com/posts/2024-09-dd-ktc-iosdc-en/",
        "description": "Reflecting on KINTO Technologies’ experience at iOSDC Japan 2024.",
        "content": "\n<h1>Introduction</h1>\n<p>Hello, everyone.\nMy name is Nakaguchi and I work in the Mobile App Development Group.\nHow did you enjoy iOSDC Japan 2024?</p>\n<p><strong>This year, it took place in August, and the excitement was higher than ever! It had the energy of a real festival!!</strong>\nThis article is for those of you who:</p>\n<ul>\n<li>Those who attended iOSDC</li>\n<li>Those who are iOS Engineers</li>\n<li>Those who love attending conferences</li>\n</ul>\n<p>I hope you’ll enjoy reading it.\nUp until last year, KINTO Technologies participation in iOSDC was mostly voluntary. Employees who were interested would attend, and afterwards, they would share their learnings via lightning talks in an internal study session or write a tech blog post.\n<br><br></p>\n<p><strong>But this year, KINTO Technologies approached iOSDC 2024 with a whole new attitude!!</strong></p>\n<p><br><br></p>\n<p>This year, we: <em>\"Became an official sponsor,\" “Submitted several proposals (and one was accepted, amazing!!🎉),\" “Held a special event to reflect on iOSDC\"</em>. We went in with a packed agenda!!</p>\n<p>To wrap it all up, I'm writing this blog post!</p>\n<h1>Sponsor’s Story</h1>\n<p><strong>This year, for the first time, KINTO Technologies became an official sponsor of iOSDC🙌!!!</strong>\nOur Tech Blog Team has evolved into a Technical PR Group, and we are putting even more effort into external events! In addition to iOSDC, which we participated in this time, we are also sponsoring DroidKaigi2024 and Developers Summit KANSAI.  We’re actively participating and increasingly showing up at large conferences!\nAt iOSDC, our Mobile App Development Group took the lead, receiving great support from our Technical Public Relations Group, the Creative Team, and other departments across the company.\nFor more details, our team members have summarized it in a separate article and presented it at the iOSDC retrospective event, which I’ll discussed later. Do Check it out!</p>\n<h3>[Tech Blog] Our First iOSDC Sponsor Diary</h3>\n<p>Here we will mainly introduces the novelties and other deliverables we created for the event! Please take a look!\n<a href=\"https://blog.kinto-technologies.com/posts/2024-08-21-iOSDC2024-novelties/\">https://blog.kinto-technologies.com/posts/2024-08-21-iOSDC2024-novelties/</a></p>\n<h3>[Tech Blog] KINTO Technologies is a Gold Sponsor of iOSDC Japan 2024 &amp; The Challenge Token is here 🚙</h3>\n<p>This article includes interviews with our employees. Please also take a look! <a href=\"https://blog.kinto-technologies.com/posts/sponsored-iosdc-japan-2024/\">https://blog.kinto-technologies.com/posts/sponsored-iosdc-japan-2024/</a></p>\n<h3>[Presentation Slide] I would like to share our journey to becoming an iOSDC sponsor</h3>\n<p>Here, we introduce how we proceed with our sponsorship in chronological order! If you’re interested in becoming a sponsor at a conference, this post will offer many valuable insights, so please check it out if you are interested!!!\n<a href=\"https://speakerdeck.com/ktchiroyah/iosdcchu-chu-zhan-matenisitashi-wogong-you-sitai\">https://speakerdeck.com/ktchiroyah/iosdcchu-chu-zhan-matenisitashi-wogong-you-sitai</a></p>\n<h1>The proposal story</h1>\n<p><strong>This year, for the first time, we held a company-wide proposal writing workshop🙌!!!</strong>\nTeam members who were interested in presenting gathered, using <a href=\"https://speakerdeck.com/tomzoh/how-to-hack-the-cfp\">these slides</a> as references, and discussed how to write the presentation and what content to include, and came up with the following proposal!</p>\n<p><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/7fd624c8-06ec-4dc4-960a-da37f74cf90f\">https://fortee.jp/iosdc-japan-2024/proposal/7fd624c8-06ec-4dc4-960a-da37f74cf90f</a></p>\n<p><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/a82414cd-54d7-4abb-aa20-e35feb717489\">https://fortee.jp/iosdc-japan-2024/proposal/a82414cd-54d7-4abb-aa20-e35feb717489</a></p>\n<p><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/e9e13b6d-0b74-4437-8ec0-ba6598b70ad7\">https://fortee.jp/iosdc-japan-2024/proposal/e9e13b6d-0b74-4437-8ec0-ba6598b70ad7</a></p>\n<p><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/ab0eeedf-0d4f-47a6-8df8-bd792b4d70ca\">https://fortee.jp/iosdc-japan-2024/proposal/ab0eeedf-0d4f-47a6-8df8-bd792b4d70ca</a></p>\n<p><strong>And the following proposal was selected!! Wow! It’s truly amazing! !🎉</strong>\n<a href=\"https://fortee.jp/iosdc-japan-2024/proposal/25af110e-61d0-4dc8-aba5-3e2e7d192868\">https://fortee.jp/iosdc-japan-2024/proposal/25af110e-61d0-4dc8-aba5-3e2e7d192868</a></p>\n<p><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/c3901357-0782-4fb5-89b8-cb48c473f066\">https://fortee.jp/iosdc-japan-2024/proposal/c3901357-0782-4fb5-89b8-cb48c473f066</a></p>\n<p>After hearing examples from other companies, I realized that they had meetings to review their proposals, and their number of submissions was on a whole different level. We can’t afford to fall behind! Next year, I want to work even harder!</p>\n<h1>Held a retrospective event for iOSDC</h1>\n<p>Large-scale events like this often come with after-events, and last year, several companies hosted iOSDC retrospective events.</p>\n<p><strong>And this year, we hosted our own event as well🙌!!!</strong></p>\n<p>I've written a pretty enthusiastic blog about why I decided to hold the event, what happened leading up to it, what it was like on the day, and more, so please do take a look!!!\n<a href=\"https://blog.kinto-technologies.com/posts/2024-09-12-after-iosdc/\">https://blog.kinto-technologies.com/posts/2024-09-12-after-iosdc/</a></p>\n<p>Below, I’ve summarized the sessions that the members who participated in the iOSDC attended.</p>\n<h1>KINTO Technologies session viewing rankings</h1>\n<p>We had 15 participants (including 4 vendors), and we’ve compiled a ranking of the sessions they watched. \nThis gives you a good idea of the kind of technologies our company is currently interested in!!</p>\n<h2>Tied for 2nd place (6 participants): Learning about typed throws in Swift 6 and the overall picture of error handling in Swift</h2>\n<p><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/c48577a8-33f1-4169-96a0-9866adc8db8e\">https://fortee.jp/iosdc-japan-2024/proposal/c48577a8-33f1-4169-96a0-9866adc8db8e</a>\nThe speaker explained not only what typed throws are but also compared them with untyped throws, which made it very easy to understand.\nAt first glance, typed throws seemed promising, but I was glad they addressed the official statement that it shouldn’t be used too lightly. It was also insightful to hear the presenter Koher’s perspective.</p>\n<h2>Tied for 2nd place (6 participants): Roundtable Discussion \"Strict Concurrency and Swift 6 Open a New Era: How to embrace the new era?\"</h2>\n<p><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/5e7b95a8-9a2e-47d5-87a7-545c46c38b25\">https://fortee.jp/iosdc-japan-2024/proposal/5e7b95a8-9a2e-47d5-87a7-545c46c38b25</a>\nWe were also researching Strict Concurrency for Swift 6, and this session was a extremely informative. I’d like to move forward with our plans based on what was presented there.\nAdditionally, the roundtable discussion format was refreshing, and it was wonderful to see everyone supporting each other. I hope to see more presentations like this in the future.</p>\n<h2>Tied for 2nd place (6 participants): Shared with Swift Package practices that accelerate development</h2>\n<p><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/52d755e6-2ba3-4474-82eb-46d845b6772c\">https://fortee.jp/iosdc-japan-2024/proposal/52d755e6-2ba3-4474-82eb-46d845b6772c</a>\nSince we are developing multiple apps, the concept of a shared Swift Package is very appealing. However, there’s a dilemma because each app has different requirements, making it difficult to find common parts to share . On the other hand, I learned a lot about the steps to create a shared Swift Package, such as team structure and operation methods.</p>\n<h2>Tied for 1st place (7 participants): Rookies LT Tournament</h2>\n<p><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/95d397a6-f81d-4809-a062-048a447279b3\">https://fortee.jp/iosdc-japan-2024/proposal/95d397a6-f81d-4809-a062-048a447279b3</a>\nOne of our team members gave a presentation, so we rushed over to cheer and support!!\nCheering with penlights was a lot of fun!!\nThe content of the talks was also very interesting, and some of our team members even said, <strong>”I want to try it next year!”</strong></p>\n<h2>Tied for 1st place (7 participants): The Magic of App Clips: A New Era in iOS Design Development</h2>\n<p><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/66f33ab0-0d73-479a-855b-058e41e1379b\">https://fortee.jp/iosdc-japan-2024/proposal/66f33ab0-0d73-479a-855b-058e41e1379b</a>\nAt our company, we haven’t yet introduced App Clip in any of our apps, so many team members were eager to try it out. However, some challenges, such as how to distribute App Clip code, are expected to arise.</p>\n<p>Below are the other sessions with high view counts.</p>\n<h4>Watched by 4 people:</h4>\n<ul>\n<li><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/f8766f69-db90-44da-9853-58f682943b12\">A thorough explanation of various \"ViewControllers\" in iOS/iPadOS and implementation examples</a></li>\n<li><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/87132db3-00f5-443a-a641-9423a1a43e7d\">Unraveling what defines an iOS app</a></li>\n<li><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/03f32923-2bb1-4044-b6e8-9774d152bdc0\">LT Tournament (Second Half)</a></li>\n<li><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/26ea2168-0d42-4b2c-8d19-31a229722665\"> Increased cross-platform adoption. Is iOS development with Swift fading away?</a></li>\n<li><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/17e37b92-9d37-4d8b-9f3c-6e34d9ba2aa1\">An introduction to software development for tackling complexity</a></li>\n</ul>\n<h4>Watched by 5 people</h4>\n<ul>\n<li><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/f9dd116a-6ce3-4083-8a7e-1148639bad48\">Understanding the data standard for integrating My Number Card on iPhone</a></li>\n<li><a href=\"https://fortee.jp/iosdc-japan-2024/proposal/d3aa5ef5-e561-45bd-a98a-ee1590e23108\">Unleashing the future of ridesharing with GraphQL and Schema-first development</a></li>\n</ul>\n<p>In addition, the average number of sessions watched per person this time was 11.25!!!</p>\n<h2>Bonus</h2>\n<p>This year, we also set up a sponsor booth, and we were curious to know which booths left the biggest impression on attendees, so we conducted a survey!\nWe received responses from 9 people, and here are the results. (Only booths with more than one vote are included.)\n<img src=\"https://blog.kinto-technologies.com/assets/blog/authors/nakaguchi/2024-09-dd-ktc-iosdc/sponsor.png\" alt=\"\"><em>We tallied the most memorable booths</em>　　\n　　\nWhen you look at the results, you can see that the votes were quite spread out. (I believe the 6 votes for our booth were out of kindness!)\nWhen I think about it, I realize how difficult it is to create a booth that appeals to everyone.\nIn the midst of this, DeNA collecting 4 votes is truly impressive.</p>\n<h1>Conclusion</h1>\n<p>As mentioned at the beginning, the entire company was very enthusiastic about this year's iOSDC!\nPersonally, I’m very satisfied with our sponsorship, proposals, and the retrospective event. However, there are still many areas for improvement, and I hope to level up even more and participate in iOSDC next year!!\nAdditionally, just like every year, the sessions were extremely informative, and I’m really glad I participated.</p>\n"
    },
    {
        "title": "Introducing In-House Club Activities: Basketball Club",
        "pubDate": "2024-11-11 10:00:00",
        "link": "https://blog.kinto-technologies.com/posts/2024-09-26-%E7%A4%BE%E5%86%85%E9%83%A8%E6%B4%BB%E5%8B%95%E7%B4%B9%E4%BB%8B-%E3%83%90%E3%82%B9%E3%82%B1%E9%83%A8%E7%B7%A8-en/",
        "description": "Introducing In-House Club Activities: Basketball Club",
        "content": "\n<h1>Introduction</h1>\n<p>Hello! My name is Ren.M from the Project Promotion Group at KINTO Technologies. My main role is to develop the front-end of <a href=\"https://up.kinto-jp.com/\"> KINTO ONE (Used Car)</a>. In this article, rather than talking about technical stuff, I would like to tell you about our company’s in-house activities!</p>\n<h1>Target audience of this article</h1>\n<ul>\n<li>People who are interested in in-house club activities</li>\n<li>People who feel there is not enough communication between employees</li>\n</ul>\n<h1>What are our in-house club activities?</h1>\n<p>Our company fosters a culture of club activities, with a variety of in-house clubs, including a futsal club, a golf club, and more! Each club has its own dedicated channel on Slack, making it easy for anyone to join or participate at their discretion. In fact, some members enjoy being part of multiple clubs!\nI’m a member of the basketball club, which rents a gymnasium near the office for practice sessions lasting about three hours each evening. While gymnasium availability is determined by a lottery system, we consistently play every month without fail.\nTo ensure smooth operations, we have volunteers who take on various responsibilities, including:</p>\n<ul>\n<li>Booking the gymnasium each month</li>\n<li>Handling payment for its usage</li>\n<li>Managing club expenses</li>\n</ul>\n<p>These tasks are shared among members on a volunteer basis.\n<img src=\"https://blog.kinto-technologies.com/assets/blog/authors/Ren.M/basketball/club0.webp\" alt=\"product\">\nOnce our reservation is confirmed, we announce it on Slack and invite participants! It depends on the day, but we usually have around ten participants joining us!</p>\n<h1>Activity Scene</h1>\n<p><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/Ren.M/basketball/club1.webp\" alt=\"product\"><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/Ren.M/basketball/club2.webp\" alt=\"product\"><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/Ren.M/basketball/club3.webp\" alt=\"product\"><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/Ren.M/basketball/club4.webp\" alt=\"product\"></p>\n<h1>What I have gained through club activities</h1>\n<h3>A refreshing break</h3>\n<p>Our company is home to many engineers, and pretty much all of them do desk jobs. Also, because I sometimes work from home, no matter how hard I try, I am prone to not getting enough exercise. Participating in club activities provides me with a vital opportunity to exercise, refreshing both my mind and body. I find myself getting really passionate during practice, but I always make a conscious effort to avoid injury while having fun!</p>\n<h3>More interaction with employees from other departments</h3>\n<p>I believe this is one of the greatest strengths of our club activities. With employees from various departments participating, it provides a unique opportunity to connect with colleagues you don’t typically work with. In meetings, having prior relationships formed through club activities can facilitate smoother collaboration, as participants are not just strangers meeting for the first time. Additionally, I hope these activities help new employees feel more at home within our company</p>\n<h1>Conclusion</h1>\n<p>I hope this gives you a glimpse into what our club activities look like. I think in-house club activities are a positive culture that allows employees to refresh themselves while deepening their friendships! If you join our company, I encourage you to engage with colleagues through these activities! There are also many other articles about them on the Tech Blog, so please take a look if you're interested!</p>\n"
    },
    {
        "title": "Using Sloth to Monitor SLOs Easily",
        "pubDate": "2024-11-08 16:00:00",
        "link": "https://blog.kinto-technologies.com/posts/2023-07-27-slo-alert-en/",
        "description": "Streamlining how to manage the complex SLO monitoring rules",
        "content": "\n<h1>Self-introduction</h1>\n<p>Hello. I am Sora Watanabe, a member of the SRE Team in the Platform Group at KINTO Technologies Corporation (from now on, KINTO Technologies). We contribute to improving the reliability of our company’s services by leveraging our experience in application development, infrastructure setup, and CI/CD for web services.</p>\n<h1>Introduction</h1>\n<p>No matter how great a service is, realistically, there is no way that problems will never occur. In today’s service delivery landscape, it’s essential to proactively set targets for an acceptable number of issues, and, in some cases, share these expectations with users to build consensus.\nSpecifically, you define the levels of service using Service Level Indicators (SLIs), then set target values for them using Service Level Objectives (SLOs). Then, you obtain the users’ agreement to these target values through Service Level Agreements or SLAs.\nHaving set your SLOs, the next step is to monitor for target violations. An alert needs to be triggered if a violation occurs. However, the rules for triggering alerts are prone to getting complex and difficult to manage.\nIn order to solve this problem, in this article, I will introduce a way to streamline creating and managing alert rules by using an alert rule generator called Sloth.</p>\n<h1>Background</h1>\n<p>As I discussed in a previous article, at KINTO Technologies, we are using the stack “Prometheus + Grafana + X-Ray” to obtain telemetry data and improve the observability of our request-response-type web services.\n<a href=\"https://blog.kinto-technologies.com/posts/2022-12-09-AWS_Prometehus_Grafana_o11y/\">https://blog.kinto-technologies.com/posts/2022-12-09-AWS_Prometehus_Grafana_o11y/</a>\nThanks to this, we are now successfully storing a wide variety of metrics in Prometheus, and for Spring Boot application metrics in particular, doing so without having to add any special instrumentation into the application code.\nThe metrics stored include the success/failure status and response rate data on a per-request basis. This has enabled us to express SLIs for availability and latency using PromQL.</p>\n<h1>Issues</h1>\n<p>Typically, after establishing SLIs and SLOs for the web service’s Critical User Journey (CUJ), you then monitor the error budget usage for the deployed service. When doing so, you need to detect potential SLO/SLA violations at an appropriate time. To do that, you need to set up alerts to enable the developers to detect anomalies.\nAccording to The Site Reliability Workbook, multi-window, multi-burn-rate alerts are the most effective and recommended approach for detecting SLO violations. A key benefit is that they offer excellent control over precision, reproducibility, detection time, and reset time, making us eager to implement them actively.\nI will briefly explain about what “window” and “burn rate” mean:</p>\n<ul>\n<li>Window<ul>\n<li>This means the measurement periods. These are the timeframes defined for when measurement begins and ends. Since SLOs are expressed as percentages, the service level resets to 100% at the start of each new measurement period when the previous one concludes. In general, the larger the window size, the harder it is to trigger and end alerts.</li>\n</ul>\n</li>\n<li>Burn rate<ul>\n<li>This refers to the rate at which the error budget is used up. Triggering an alert only after the error budget is fully consumed would be too late; ideally, an alert should be triggered once a certain portion of it has been used. The burn rate is calculated by defining a reference value of 1, which represents the rate at which the error budget would reach exactly 0 by the end of the measurement window if consumed at a steady pace. Then, the actual consumption rate is measured against this reference to see how many times faster the error budget is being depleted. This multiple is recorded as the burn rate. You configure the system to trigger an alert when the burn rate surpasses a predetermined threshold.\nFor more information on multiwindow, multi-burn-rate alerts, see Chapter 5, “Alerting on SLOs” in The Site Reliability Workbook. <a href=\"https://www.oreilly.co.jp/books/9784873119137/\">https://www.oreilly.co.jp/books/9784873119137/</a> The English version has been published on the web: <a href=\"https://sre.google/workbook/alerting-on-slos/#6-multiwindow-multi-burn-rate-alerts\">https://sre.google/workbook/alerting-on-slos/#6-multiwindow-multi-burn-rate-alerts</a>\nTo use the multiwindow, multi-burn-rate alerts approach, you need to set up an alert rule that specifies multiple windows and burn rates—i.e., multiple different parameters—for a single SLI/SLO definition.\nAs a result, a challenge has been that the number of alert rules grows to the point where they become difficult to manage.</li>\n</ul>\n</li>\n</ul>\n<h1>What we will do</h1>\n<p>In this article, we will use an open source tool called Sloth to solve this issue.\n<a href=\"https://sloth.dev/\">https://sloth.dev/</a>\nBy using Sloth, you can define SLI/SLO specifications with simple descriptions, which then generate Prometheus recording rules and alert rule definition files—tasks that would otherwise be complex and prone to errors.\nAt KINTO Technologies, we adopt a configuration like the one in the figure below.\n<img src=\"https://blog.kinto-technologies.com/assets/blog/authors/sora_watanabe/20230806/system_view.png\" alt=\"Overall configuration diagram\">\nSloth is able to generate multiwindow, multi-burn rate alert rules by default. Therefore, in this article, I will show you how to set up multiwindow, multi-burn rate alert rules using Sloth.</p>\n<h1>Generating alert rules</h1>\n<p>:::message\nSloth allows you to input SLI/SLO specification files that adhere to OpenSLO standard However, these currently do not appear to support generating Prometheus alert rules, so we have opted to use Sloth’s own SLI/SLO specification format instead.\n:::</p>\n<p>The following simple SLI/SLO specification is expressed in a YAML file based on the Sloth standards.</p>\n<table>\n<thead><tr>\n<th>Category</th>\n<th>SLI</th>\n<th>SLO</th>\n</tr></thead>\n<tbody><tr>\n<td>Availability</td>\n<td>The percentage of successful requests measured by the application over a 30-day period. Consider any HTTP status outside the ranges 500–599 and 429 as successful. Consolidate and measure all request paths except actuator.</td>\n<td>99.5%</td>\n</tr></tbody>\n</table>\n<pre><code class=\"language-yml:slo_spec.yml\">version: \"prometheus/v1\"\nservice: \"KINTO\"\nlabels:\n  owner: \"KINTO Technologies Corporation\"\n  repo: \"slo-maintenance\"\n  tier: \"2\"\nslos:\n  # We allow failing (5xx and 429) 5 request every 1000 requests (99.5%).\n  - name: \"kinto-requests-availability\"\n    objective: 99.5\n    description: \"Common SLO based on availability for HTTP request responses.\"\n    sli:\n      events:\n        error_query: sum(rate(http_server_requests_seconds_count{application=\"kinto\",status=~\"(5..|429)\",uri!~\".*actuator.*\"}[{{.window}}]))\n        total_query: sum(rate(http_server_requests_seconds_count{application=\"kinto\",uri!~\".*actuator.*\"}[{{.window}}]))\n    alerting:\n      name: KINTOHighErrorRate\n      labels:\n        category: \"availability\"\n      annotations:\n        # Overwrite default Sloth SLO alert summary on ticket and page alerts.\n        summary: \"High error rate on 'KINTO SERVICE' requests responses\"\n      page_alert:\n        labels:\n          severity: \"critical\"\n      ticket_alert:\n        labels:\n          severity: \"warning\"\n</code></pre>\n<p><code>http_server_requests_seconds_count</code> is a metric for when using Spring Boot. With this file saved in the ./source/ directory, run the following command:</p>\n<pre><code class=\"language-shell\">docker pull ghcr.io/slok/sloth\ndocker run -v /$(pwd):/home ghcr.io/slok/sloth generate -i /home/source/slo_spec.yml &gt; slo_generated_rules.yml\n</code></pre>\n<p>Running the above command generates the following files in the current directory. The generated files can be uploaded to Prometheus as is.\n:::details slo_generate_rules.yml</p>\n<pre><code class=\"language-yml:slo_generate_rules.yml\">---\n# Code generated by Sloth (a9d9dc42fb66372fb1bd2c69ca354da4ace51b65): https://github.com/slok/sloth.\n# DO NOT EDIT.\ngroups:\n- name: sloth-slo-sli-recordings-KINTO-kinto-requests-availability\n  rules:\n  - record: slo:sli_error:ratio_rate5m\n    expr: |\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",status=~\"(5..|429)\",uri!~\".*actuator.*\"}[5m])))\n      /\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",uri!~\".*actuator.*\"}[5m])))\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      sloth_window: 5m\n      tier: \"2\"\n  - record: slo:sli_error:ratio_rate30m\n    expr: |\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",status=~\"(5..|429)\",uri!~\".*actuator.*\"}[30m])))\n      /\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",uri!~\".*actuator.*\"}[30m])))\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      sloth_window: 30m\n      tier: \"2\"\n  - record: slo:sli_error:ratio_rate1h\n    expr: |\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",status=~\"(5..|429)\",uri!~\".*actuator.*\"}[1h])))\n      /\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",uri!~\".*actuator.*\"}[1h])))\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      sloth_window: 1h\n      tier: \"2\"\n  - record: slo:sli_error:ratio_rate2h\n    expr: |\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",status=~\"(5..|429)\",uri!~\".*actuator.*\"}[2h])))\n      /\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",uri!~\".*actuator.*\"}[2h])))\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      sloth_window: 2h\n      tier: \"2\"\n  - record: slo:sli_error:ratio_rate6h\n    expr: |\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",status=~\"(5..|429)\",uri!~\".*actuator.*\"}[6h])))\n      /\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",uri!~\".*actuator.*\"}[6h])))\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      sloth_window: 6h\n      tier: \"2\"\n  - record: slo:sli_error:ratio_rate1d\n    expr: |\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",status=~\"(5..|429)\",uri!~\".*actuator.*\"}[1d])))\n      /\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",uri!~\".*actuator.*\"}[1d])))\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      sloth_window: 1d\n      tier: \"2\"\n  - record: slo:sli_error:ratio_rate3d\n    expr: |\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",status=~\"(5..|429)\",uri!~\".*actuator.*\"}[3d])))\n      /\n      (sum(rate(http_server_requests_seconds_count{application=\"kinto\",uri!~\".*actuator.*\"}[3d])))\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      sloth_window: 3d\n      tier: \"2\"\n  - record: slo:sli_error:ratio_rate30d\n    expr: |\n      sum_over_time(slo:sli_error:ratio_rate5m{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"}[30d])\n      / ignoring (sloth_window)\n      count_over_time(slo:sli_error:ratio_rate5m{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"}[30d])\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      sloth_window: 30d\n      tier: \"2\"\n- name: sloth-slo-meta-recordings-KINTO-kinto-requests-availability\n  rules:\n  - record: slo:objective:ratio\n    expr: vector(0.995)\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      tier: \"2\"\n  - record: slo:error_budget:ratio\n    expr: vector(1-0.995)\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      tier: \"2\"\n  - record: slo:time_period:days\n    expr: vector(30)\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      tier: \"2\"\n  - record: slo:current_burn_rate:ratio\n    expr: |\n      slo:sli_error:ratio_rate5m{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"}\n      / on(sloth_id, sloth_slo, sloth_service) group_left\n      slo:error_budget:ratio{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"}\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      tier: \"2\"\n  - record: slo:period_burn_rate:ratio\n    expr: |\n      slo:sli_error:ratio_rate30d{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"}\n      / on(sloth_id, sloth_slo, sloth_service) group_left\n      slo:error_budget:ratio{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"}\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      tier: \"2\"\n  - record: slo:period_error_budget_remaining:ratio\n    expr: 1 - slo:period_burn_rate:ratio{sloth_id=\"KINTO-kinto-requests-availability\",\n      sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"}\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      tier: \"2\"\n  - record: sloth_slo_info\n    expr: vector(1)\n    labels:\n      owner: KINTO Technologies Corporation\n      repo: slo-maintenance\n      sloth_id: KINTO-kinto-requests-availability\n      sloth_mode: cli-gen-prom\n      sloth_objective: \"99.5\"\n      sloth_service: KINTO\n      sloth_slo: kinto-requests-availability\n      sloth_spec: prometheus/v1\n      sloth_version: a9d9dc42fb66372fb1bd2c69ca354da4ace51b65\n      tier: \"2\"\n- name: sloth-slo-alerts-KINTO-kinto-requests-availability\n  rules:\n  - alert: KINTOHighErrorRate\n    expr: |\n      (\n          max(slo:sli_error:ratio_rate5m{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"} &gt; (14.4 * 0.005)) without (sloth_window)\n          and\n          max(slo:sli_error:ratio_rate1h{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"} &gt; (14.4 * 0.005)) without (sloth_window)\n      )\n      or\n      (\n          max(slo:sli_error:ratio_rate30m{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"} &gt; (6 * 0.005)) without (sloth_window)\n          and\n          max(slo:sli_error:ratio_rate6h{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"} &gt; (6 * 0.005)) without (sloth_window)\n      )\n    labels:\n      category: availability\n      severity: critical\n      sloth_severity: page\n    annotations:\n      summary: High error rate on 'KINTO SERVICE' requests responses\n      title: (page) {{$labels.sloth_service}} {{$labels.sloth_slo}} SLO error budget\n        burn rate is too fast.\n  - alert: KINTOHighErrorRate\n    expr: |\n      (\n          max(slo:sli_error:ratio_rate2h{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"} &gt; (3 * 0.005)) without (sloth_window)\n          and\n          max(slo:sli_error:ratio_rate1d{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"} &gt; (3 * 0.005)) without (sloth_window)\n      )\n      or\n      (\n          max(slo:sli_error:ratio_rate6h{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"} &gt; (1 * 0.005)) without (sloth_window)\n          and\n          max(slo:sli_error:ratio_rate3d{sloth_id=\"KINTO-kinto-requests-availability\", sloth_service=\"KINTO\", sloth_slo=\"kinto-requests-availability\"} &gt; (1 * 0.005)) without (sloth_window)\n      )\n    labels:\n      category: availability\n      severity: warning\n      sloth_severity: ticket\n    annotations:\n      summary: High error rate on 'KINTO SERVICE' requests responses\n      title: (ticket) {{$labels.sloth_service}} {{$labels.sloth_slo}} SLO error budget\n        burn rate is too fast.\n</code></pre>\n<p>:::\nThis time, we generated a simple example, but in practice, you’ll likely define multiple, more complex SLI/SLO specifications. Without Sloth, you would need to manage lengthy, generated-like code directly. Sloth significantly reduces the hassle involved in this process</p>\n<h1>Configuration procedure</h1>\n<p>At KINTO Technologies, we use Amazon Managed Service for Prometheus. This enables you to upload the generated files via the AWS Managed Console.\nFor more information on how to use Amazon Managed Service for Prometheus, please refer to the official documentation:\n<a href=\"https://docs.aws.amazon.com/ja_jp/prometheus/latest/userguide/AMP-rules-upload.html\">https://docs.aws.amazon.com/ja_jp/prometheus/latest/userguide/AMP-rules-upload.html</a>\nAlternatively, you can run the AWS CLI from a workflow. Here is an example using GitHub Actions.</p>\n<pre><code class=\"language-yml:setupslo.yml\">name: SLO set up\non:\n  workflow_dispatch:\njobs:\n  setup-slo:\n    name: Set up SLOs\n    runs-on: ubuntu-latest\n    steps:\n      - uses: actions/checkout@v3\n      - name: Set AWS Credentials to EnvParam(Common)\n        uses: aws-actions/configure-aws-credentials@v2\n        with:\n          aws-access-key-id: ${{ AWS access key to be used }}\n          aws-secret-access-key: ${{ AWS secret access key to be used }}\n          aws-region: ${{ AWS region to be used }}\n      ## Generate a configuration file from the definition file\n      - name: download and setup generator binary\n        run: |\n          ## Please check the latest release situation as appropriate.\n          wget https://github.com/slok/sloth/releases/download/vX.XX.X/sloth-linux-amd64\n          chmod +x sloth-linux-amd64\n          ./sloth-linux-amd64 validate -i ./services/kinto/source/slo_spec.yml\n          ./sloth-linux-amd64 generate -i ./services/kinto/source/slo_spec.yml -o ./services/kinto/configuration.yml\n      ## Upload the configuration file to Prometheus\n      - name: upload configuration file to APM\n        run: |\n          base64 ./services/kinto/configuration.yml &gt; ./services/kinto/configuration_base_64.yml\n          aws amp create-rule-groups-namespace \\\n            --data file://./services/kinto/configuration_base_64.yml \\\n            --name slo-rules \\\n            --workspace-id ${{ ID of the AMP workspace to be used }} ¥\n            --region ${{ AWS region to be used }}\n</code></pre>\n<h2>Visual representation</h2>\n<p>Once the rule file has been uploaded to Prometheus, the next step is to represent the data visually. We use Grafana. Grafana Labs provides a dashboard template for Sloth, allowing you to visually represent the generated rules by simply importing it.\n<a href=\"https://sloth.dev/introduction/dashboards/\">https://sloth.dev/introduction/dashboards/</a></p>\n<h2>Procedure for configuring alerts</h2>\n<p>Multiwindow, multi-burn rate alerts are sent from Prometheus. Create an Alert manager configuration file and upload it to Prometheus.\n<a href=\"https://docs.aws.amazon.com/ja_jp/prometheus/latest/userguide/AMP-alertmanager-config.html\">https://docs.aws.amazon.com/ja_jp/prometheus/latest/userguide/AMP-alertmanager-config.html</a>\n:::message With “Amazon Managed Service for Prometheus,” only notifications to Amazon SNS are currently supported. (We are hoping this will improve in the future!) Consequently, we create SNS topics in advance, then specify the topics’ ARNs in the configuration file. :::\nAt KINTO Technologies, we create a configuration file similar to the following to separate the routing of Critical and Warning alerts. The SNS attributes sent include the alert type information.</p>\n<pre><code class=\"language-yml:alertmanager_config.yml\">alertmanager_config: |\n  # The root route on which each incoming alert enters.\n  route:\n    # A default receiver\n    receiver: warning_alert\n    routes:\n      - receiver: critical_alert\n        matchers:\n        - severity=\"critical\"\n      - receiver: warning_alert\n        matchers:\n        - severity=\"warning\"\n  # Amazon Managed Service for Prometheus,\n  # The only receiver currently supported is Amazon Simple Notification Service (Amazon SNS).\n  # If you have other types of receivers listed in the configuration, it will be rejected.\n  # Expect future revisions. https://docs.aws.amazon.com/ja_jp/prometheus/latest/userguide/AMP-alertmanager-config.html\n  receivers:\n    - name: critical_alert\n      sns_configs:\n        - topic_arn: arn:aws:sns:{AWS region}:{AWS account}:prometheus-alertmanager\n          sigv4:\n            region: {AWS region}\n          attributes:\n            severity: critical\n            slack_api_url: '&lt;your slack api url&gt;'\n            slack_channel: '#&lt;your channel name&gt;'\n    - name: warning_alert\n      sns_configs:\n        - topic_arn: arn:aws:sns:{AWS region}:{AWS account}:prometheus-alertmanager\n          sigv4:\n            region: {AWS region}\n          attributes:\n            severity: warning\n            slack_api_url: '&lt;your slack api url&gt;'\n            slack_channel: '#&lt;your channel name&gt;'\n</code></pre>\n<p>Also, we subscribe to the SNS topics on AWS Lambda. Lambda uses the attributes from the triggered notification to dynamically route the alerts to the appropriate Slack channels. In practice, we will customize this more, for example, by making it hit the PagerDuty API if a Critical alert is triggered.</p>\n<pre><code class=\"language-python:alertmanager_function.py\">#\n# this script based on https://aws.amazon.com/jp/premiumsupport/knowledge-center/sns-lambda-webhooks-chime-slack-teams/\n#\nimport urllib3\nimport json\nhttp = urllib3.PoolManager()\ndef lambda_handler(event, context):\n    print({\"severity\": event[\"Records\"][0][\"Sns\"][\"MessageAttributes\"][\"severity\"][\"Value\"]})\n    url = event[\"Records\"][0][\"Sns\"][\"MessageAttributes\"][\"slack_api_url\"][\"Value\"]\n    msg = {\n        \"channel\": event[\"Records\"][0][\"Sns\"][\"MessageAttributes\"][\"slack_channel\"][\"Value\"],\n        \"username\": \"PROMETHEUS_ALERTMANAGER\",\n        \"text\": event[\"Records\"][0][\"Sns\"][\"Message\"],\n        \"icon_emoji\": \"\",\n    }\n    encoded_msg = json.dumps(msg).encode(\"utf-8\")\n    resp = http.request(\"POST\", url, body=encoded_msg)\n    print(\n        {\n            \"message\": event[\"Records\"][0][\"Sns\"][\"Message\"],\n            \"status_code\": resp.status,\n            \"response\": resp.data,\n        }\n    )\n</code></pre>\n<h1>Neat approaches we came up with</h1>\n<h2>SLOs as Code</h2>\n<p>With Sloth, you can encode SLI/SLO specifications in the YAML file format. Since this is code, the version can be managed using tools like Git. In addition, you can use hosting tools such as GitHub to make it easier to review. As long as the SLI/SLO specifications are compatible with Prometheus (expressible using PromQL), they can be applied not only to applications but also to metrics monitoring for load balancers and external monitoring services. So, it is fair to say that Sloth has a wide scope of application.\nIn the KINTO Technologies SRE Team, we consolidate all the YAML-format SLI/SLO specifications into a single GitHub repository. The SRE team provides a template in the repository, and the development teams define SLI/SLO specifications based on that, commit them, then create a pull request. The SRE team then reviews the pull request. This procedure makes it possible to understand the SLI/SLO specifications and reflect them in the monitoring smoothly. \nThis approach helps reduce management costs and allows SLOs for any product to be more easily referenced across KINTO Technologies’ entire development organization.\nThe service level of a dependency has a significant impact on the service level of its own service. Since KINTO Technologies' services rely on each other, sharing service levels across organizational boundaries helps maintain the service levels of individual services more effectively.</p>\n<h2>Latency SLI</h2>\n<p>With \"slow being the new down,\" we need to monitor response times in addition to tracking 5xx errors. We will represent the following simple SLI/SLO specification in a YAML file that follows the Sloth standards.</p>\n<table>\n<thead><tr>\n<th>Category</th>\n<th>SLI</th>\n<th>SLO</th>\n</tr></thead>\n<tbody><tr>\n<td>Latency</td>\n<td>Among the successful requests measured by the application, consolidate and measure all request paths except actuator. Among 30 days’ worth of requests, the percentage of those that return a response in less than 3,000 milliseconds.</td>\n<td>99%</td>\n</tr></tbody>\n</table>\n<pre><code class=\"language-yml:slo_spec.yml\">version: \"prometheus/v1\"\nservice: \"KINTO\"\nlabels:\n  owner: \"KINTO Technologies Corporation\"\n  repo: \"slo-maintenance\"\n  tier: \"2\"\nslos:\n  ...\n  # We allow failing (less than 3000ms) and (5xx and 429) 990 request every 1000 requests (99%).\n  - name: \"kinto-requests-latency-99percent-3000ms\"\n    objective: 99\n    description: \"Common SLO based on latency for HTTP request responses.\"\n    sli:\n      raw:\n        # Get the average satisfaction ratio and rest 1 (max good) to get the error ratio.\n        error_ratio_query: |\n          1 - (\n            sum(rate(http_server_requests_seconds_bucket{le=\"3\",application=\"kinto\",status!~\"(5..|429)\",uri!~\".*actuator.*\"}[{{.window}}]))\n            /\n            sum(rate(http_server_requests_seconds_count{application=\"kinto\",status!~\"(5..|429)\",uri!~\".*actuator.*\"}[{{.window}}]))\n          )\n    alerting:\n      name: KINTOHighErrorRate\n      labels:\n        category: \"latency\"\n      annotations:\n        summary: \"High error rate on 'kinto service' requests responses\"\n      page_alert:\n        labels:\n          severity: \"critical\"\n      ticket_alert:\n        labels:\n          severity: \"warning\"\n</code></pre>\n<p>To get the data in histogram form, add the following settings to application.yml:</p>\n<pre><code class=\"language-yml:application.yml\">management:\n  ...\n  metrics:\n    tags:\n      application: ${spring.application.name}\n    distribution:\n      percentiles-histogram:\n        http:\n          server:\n            requests: true\n      slo:\n        http:\n          server:\n            requests: 100ms, 500ms, 3000ms\n</code></pre>\n<p>Adding the settings below <code>management.metrics.distribution</code> configures it to give the metrics via the histogram-type <code>percentages-histogram</code> rather than the summary-type <code>percentiles</code>. \nThe reason for this is that <code>percentiles</code> aggregate response times for a specific percentile only on a per-task basis and for the last minute, meaning they cannot be aggregated across multiple tasks or over an extended period, like 30 days. On the other hand, <code>percentiles-histogram</code> stores the number of requests with response times within the threshold as a value, so they can be aggregated for an arbitrary range across multiple tasks using PromQL.\nThis approach allows us to define the latency SLI specification as the percentage of total requests that meet the specified criteria.</p>\n<h1>Discussion</h1>\n<h2>Recommendation for a settable SLO: At least 94%</h2>\n<p>The Site Reliability Workbook provides recommended window and burn rate thresholds for detecting error budget consumption.\n<a href=\"https://sre.google/workbook/alerting-on-slos/#6-multiwindow-multi-burn-rate-alerts\">https://sre.google/workbook/alerting-on-slos/#6-multiwindow-multi-burn-rate-alerts</a></p>\n<p>By default, Sloth supports several of the burn rates given in the Site Reliability Workbook. Consequently, the maximum burn rate threshold for which alerts can occur is 14.4.\nIn this case, for example, if the SLO is 93%, the error budget will be 7%. If we calculate the error rate for a burn rate of 14.4, we get 14.4 * 7 = 100.8. Basically, the error rate is calculated using “error requests divided by all requests,” so it cannot exceed 100. This means that if you set the SLO to 93%, there is zero probability that an alert will be fired that reports a burn rate above 14.4.\nConsequently, we recommend setting an SLO of at least 94%.</p>\n<h1>Conclusion</h1>\n<p>In my previous articles, I’ve shared the initiatives we’re working on within the KINTO Technologies SRE Team. What did you think? \nWhile the organization as a whole isn’t required to manage service levels with extreme rigor, we’re pleased to have the flexibility to easily test useful alerts using the techniques described here.\nThe Platform Group is actively looking for new team members to join us If you are interested and would like to hear more, please feel free to contact us!\n@<a href=\"https://hrmos.co/pages/kinto-technologies/jobs?category=1702971262959611904&amp;_gl=1*a8bse7*_ga*MTk1NDIyMzgzMi4xNjc2MzczMjM2*_ga_0305ZR8RCP*MTY4OTIyNjQ4OS43Mi4xLjE2ODkyMjY0OTcuMC4wLjA\">card</a></p>\n"
    },
    {
        "title": "OSS CMS Tool Strapi Case Study",
        "pubDate": "2024-11-07 10:00:00",
        "link": "https://blog.kinto-technologies.com/posts/2024-08-DD-introducing-strapi-en/",
        "description": "OSS CMS Tool Strapi Case Study",
        "content": "\n<h2>Introduction</h2>\n<p>Hello. I appreciate you taking the time to read this! My name is Nakamoto, and I work on developing the frontend for <a href=\"https://factory.kinto-jp.com/\">KINTO FACTORY</a> ('FACTORY' in this article), a service that enables users to upgrade their current vehicles.\nIn this article, I would like to introduce <a href=\"https://strapi.io/\">Strapi</a>, an open-source tool which we implemented to create and manage the content for the newly launched <a href=\"https://factory.kinto-jp.com/magazine/\">FACTORY Magazine</a>.</p>\n<h2>What is Strapi?</h2>\n<p>Strapi is a self-hosted, headless CMS that, unlike other SaaS-based CMS options, allows users to set up and manage their own servers, databases, and environments. (Strapi also offers <a href=\"https://strapi.io/pricing-cloud\">Strapi Cloud</a>, which provides a cloud environment.)\nAt KINTO, we’ve worked with several SaaS CMS platforms to publish columns and articles. However, encountered limitations balancing operational efficiency with costs, along with the limited flexibility to add new features or customize existing ones. This led us to explore OSS CMS tools with the aim of setting up a self-hosted solution.\nWordPress is likely the most recognized OSS headless CMS. However, while researching other tools that are recently gaining popularity. This is how we came across Strapi.\nWhen evaluating open-source tools, we prioritized the following:</p>\n<ul>\n<li>\n<strong>Usability</strong>: A user-friendly management UI, accessible to both developers and content managers</li>\n<li>\n<strong>Community Support</strong>: Backed by a large community and extensive documentation</li>\n<li>\n<strong>Plugin Variety</strong>: A diverse range of plugins for easily extending functionality</li>\n<li>\n<strong>Scalability</strong>: Built on Node.js for high performance and scalability\nIf certain functions were missing or didn’t align with our needs, we could easily modify or create plugins using our JavaScript expertise. The low implementation cost was also a key factor in our decision.</li>\n</ul>\n<h2>Architecture and Deployment Mechanism</h2>\n<p>Strapi, like FACTORY's e-commerce site, is hosted on AWS and consists of a simple architecture using ECS and Aurora. Strapi, as a CMS, operates independently from FACTORY's web application, primarily supporting internal teams like business units in writing and publishing articles.\nWhen publishing an article, it triggers a build of the web application, during which article information is retrieved from Strapi's API and directly embedded into the page. \nThis setup means that users don’t directly interact with Strapi, creating a closed network for the CMS environment and eliminating unnecessary external access.\n<img src=\"https://blog.kinto-technologies.com/assets/blog/authors/k.nakamoto/strapi-intro/deploy.jpg\" alt=\"deploy.jpg\"></p>\n<h2>Customization Case Study</h2>\n<p>Let’s take a look at some of the customizations we implemented during the setup process.</p>\n<h3>Creating new plugins</h3>\n<p>In FACTORY magazine, there is a page titled <a href=\"https://factory.kinto-jp.com/magazine/category/voc/\">User's Voice</a> that features interviews with customers who have purchased and installed items from FACTORY. \nFor these articles, it’s essential to link the car models or item names associated with each installation. Users enter details like \"car model name (e.g., RAV4)\" or \"item name (e.g., Headlamp Design Upgrade)\" in the standard input field.</p>\n<table>\n<thead><tr>\n<th>Vehicle Information Entry</th>\n</tr></thead>\n<tbody><tr>\n<td><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/k.nakamoto/strapi-intro/input_vehicle.jpg\" alt=\"input_vehicle.jpg\"></td>\n</tr></tbody>\n</table>\n<p>However, allowing free text entry can lead to inconsistencies in naming. To make it easier to search articles by car model or item—similar to a blog—it's more effective to link item IDs and other data stored within FACTORY to the articles. We addressed this by creating dropdown lists for these input fields, utilizing the BFF (Backend for Frontend) services already in place for the e-commerce site.</p>\n<table>\n<thead><tr>\n<th>Vehicle Selection</th>\n<th>Item Selection</th>\n</tr></thead>\n<tbody><tr>\n<td><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/k.nakamoto/strapi-intro/select_vehicle.png\" alt=\"select_vehicle.png\"></td>\n<td><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/k.nakamoto/strapi-intro/select_item.png\" alt=\"select_item.png\"></td>\n</tr></tbody>\n</table>\n<p>With this approach, the custom plugins enable precise linking of item and car model information. We also customized the images for an intuitive display, simplifying selection for the author. Leveraging the existing BFF from the e-commerce site highlights another advantage of a self-hosted CMS. Unlike SaaS solutions, this setup offers greater flexibility for customizations while minimizing security risks, as mentioned earlier.</p>\n<p>:::message\nAn article on creating a custom API has already been published, so I encourage you to check that out as well!</p>\n<ul>\n<li>\n<a href=\"https://blog.kinto-technologies.com/posts/2024-06-06-AddCustomAPIForStrapi/\">Implementing a custom API in Strapi</a>\n:::</li>\n</ul>\n<h3>Customizing existing plugins</h3>\n<p>As another example of customization, we introduced this existing plugin,<a href=\"https://market.strapi.io/plugins/strapi-plugin-tagsinput\">tagsinput</a>, to meet the requirement of searching for similar articles by linking tags to them.\nHowever, this plugin saves the entered tags in the database as an associative array, like this: <code>[{ name: tag1 }, { name: tag2 }]</code>. This made the search logic complicated when creating an API to search by tags.\nSo, to simplify the search, I made slight customizations to the plugin, changing it to store the entered tags as an array of strings <code>[tag1, tag2]</code>.\n<a href=\"https://github.com/canopas/strapi-plugin-tagsinput/blob/1.0.6/admin/src/components/Input/index.js#L29-L36\">https://github.com/canopas/strapi-plugin-tagsinput/blob/1.0.6/admin/src/components/Input/index.js#L29-L36</a></p>\n<pre><code class=\"language-diff\">@@ -26,8 +26,7 @@\n   const { formatMessage } = useIntl();\n   const [tags, setTags] = useState(() =&gt; {\n     try {\n-      const values = JSON.parse(value);\n-      return values.map((value) =&gt; value.name);\n+      return JSON.parse(value) || [];\n     } catch (e) {\n       return [];\n     }\n</code></pre>\n<p><a href=\"https://github.com/canopas/strapi-plugin-tagsinput/blob/1.0.6/admin/src/components/Input/index.js#L64-L70\">https://github.com/canopas/strapi-plugin-tagsinput/blob/1.0.6/admin/src/components/Input/index.js#L64-L70</a></p>\n<pre><code class=\"language-diff\">@@ -38,7 +37,7 @@\n     onChange({\n       target: {\n         name,\n-        value: JSON.stringify(tags.map((tag) =&gt; ({ name: tag }))),\n+        value: JSON.stringify(tags),\n         type: attribute.type,\n       },\n     });\n</code></pre>\n<p>This approach makes it easy to tweak existing plugins, tailoring them to better suit our specific needs.\nOne of the key customizations we've implemented is adding video tags to CKEditor, the rich text editor Strapi uses for article postings. Since this requires a more in-depth explanation, we’ll cover it in a separate article.</p>\n<h2>Conclusion</h2>\n<p>FACTORY was the first among KINTO's services to introduce Strapi, an open-source CMS tool. \nTeams using Strapi for writing and posting articles have shared positive feedback, noting it’s \"easier to use than SaaS-based CMS services\"—a promising sign for the tool’s future. We’re already receiving feature requests, which we plan to address by taking full advantage of Strapi’s customizability.\nAlthough we’re in the early stages of operations, I’m excited to gain experience and explore Strapi’s potential, looking beyond article publishing to find innovative uses. I also plan to share FACTORY's approach with other KINTO services using SaaS CMS tools, aiming to foster broader adoption and development across the company.</p>\n"
    },
    {
        "title": "Introduction of Selective Disclosure JWT",
        "pubDate": "2024-11-06 10:00:00",
        "link": "https://blog.kinto-technologies.com/posts/2024-04-18-Selective%20Disclosure%20JWT-en/",
        "description": "Introduction of Selective Disclosure JWT",
        "content": "\n<h1>Introduction</h1>\n<p><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/jun.liang/poster.png\" alt=\"part1\"> Hello, I'm Ryo, a developer of ID Platform in the Global Development Group. I participated in the <a href=\"https://www.openid.or.jp/summit/2024/\">OpenID Summit</a> at Shibuya Stream Hall on January 19th 2024, so I am writing this article to share my impressions and the interesting points I found. Due to the COVID-19 pandemic, the summit was held for the first time in four years since the OpenID Summit Tokyo 2020. It was very exciting as many people who are interested in OpenID gathered at the venue on the day of the event. The topic this time was regarding what kind of change digital identity has brought about in the four years surrounding the COVID-19 pandemic, and what kind of development digital identity is likely to take place in the world in the future.</p>\n<h1>Program Flow</h1>\n<p><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/jun.liang/schedule1.png\" alt=\"part1\"><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/jun.liang/schedule2.png\" alt=\"part2\"></p>\n<h2>Impressions</h2>\n<p>OpenID is not a very well known topic compared to other highly versatile technology fields, and I think there are many people who have never heard of it. However, when I arrived at the summit venue, there were many people who were interested in OpenID from many companies. I was a little surprised. Some people were attending for the first time, so in the morning, we were introduced to the history of OpenID's development so far, the future development and outlook for OpenID in the areas of digital identity and electronic money, and details of the translation of materials and human resource development activities being carried out by the OpenID Foundation Japan Working Group. From the content presented in the morning, I deeply felt that the future direction of OpenID development is changing from the area of authentication and authorization to identity verification (digital identity) and electronic payments management.\nAs for the topics presented in the afternoon, each company explained the problems encountered during the implementation and operation stage of OpenID and the overall solutions and countermeasures. However, the afternoon program was held at two different venues, and since I cannot make copies of myself like <a href=\"https://naruto-official.com/\">Naruto</a>, unfortunately I could not attend both at the same time.</p>\n<h2>Impressive presentation</h2>\n<h3>Consideration of countermeasures against spoofing attacks when using OpenID Connect</h3>\n<p>Presenter: <a href=\"https://www.openid.or.jp/summit/2024/speakers.html#speaker_junki_yuasa\"> Junki Yuasa (Nara Institute of Science and Technology, Laboratory for Cyber Resilience).</a> The case presented here is quite rare, but I was surprised that a second-year master's student had delved so deeply into OpenID operation experiments. Although there are several authentication modes for OpenID, security may be low depending on the usage scenario, so I think that in future developments, we should be careful about risky parts in specific cases like this one.</p>\n<h3>Mercari App Access Token</h3>\n<p>Presenter: <a href=\"https://www.openid.or.jp/summit/2024/speakers.html#speaker_gia_nguyen\"> Nguyen Da (Mercari, Inc. ID Platform Team Software Engineer ).</a> The <a href=\"https://jp.mercari.com/\"> Mercari App</a> is well-known in Japan as a very popular online second hand marketplace. The ID Platform Engineer explained how Mercari ID faced some difficulties with the old method of operation, and how they worked to make it easier for users to use the service on the mobile app and browser. With that, I learned that although we have achieved many goals in utilizing browser cookies, only <strong>Chrome</strong> browsers have special specifications, with a <strong>cookie validity period of 400 days</strong>. Since we launched our ID platform, we have gone through many challenges and efforts regarding UI and UX, but I learned for the first time that the <strong>cookie validity period is 400 days</strong>.</p>\n<h2>About JWT</h2>\n<p>You may have heard of the name JWT (JSON Web Token), but if you are not familiar with authentication and authorization, you may not have had a chance to learn about the role of JWT or the interrelationship between JWK, JWS, and JWE, which are often mentioned together. So let me give a brief explanation in advance:</p>\n<blockquote>\n<ol>\n<li>JWT is a <strong>standard</strong> for ensuring the reliability of information exchanged on a network. Among them, JWS and JWE are examples of the implementation of the JWT standard.</li>\n<li>JWS (JSON Web Signature) uses \".\" as shown in the figure below.It is divided into three parts: ** Header (authentication method), Payload (actual information), Signature (guarantee against tampering)**. <img src=\"https://blog.kinto-technologies.com/assets/blog/authors/jun.liang/JWS.png\" alt=\"part1\"> JWS has been base64 encoded, so the decoded Payload has all the information disclosed.</li>\n<li>According to the explanation of JWT, JWK (Json Web Key) is an encryption key that is written in the JWT Header and used to encrypt the hash of the Payload contents to generate a Signature.</li>\n<li>JWE (JSON Web Encryption) is a JWT that can protect the safety and integrity of the JWS mentioned above. So, it was divided into five parts using \".\", with the second being a Payload-specific code that serves as the decryption key. Only the owner of the encryption key can decrypt the contents of the Payload. <img src=\"https://blog.kinto-technologies.com/assets/blog/authors/jun.liang/JWE.png\" alt=\"part2\"><a href=\"https://www.jianshu.com/p/50ade6f2e4fd\">Source</a>\n</li>\n</ol>\n</blockquote>\n<h2>SD-JWT</h2>\n<p>At this OpenID Summit, Italy's track record of electronic money implementation and operation was introduced.  Here, they explained a new concept for me called <strong>SD-JWT</strong>. This was the first time I had heard of it, so I looked it up myself after the summit ended.  From here on, we will finally delve into the main subject of this article.  I would like to briefly explain what I found about SD-JWT. Selective Disclosure JWT (SD-JWT) is, as the name suggests, a JWT in which particular information is only disclosed to selected parties. I will first explain the background to the design of SD-JWT, when JWS and JWE already exist in the world. <strong>There are currently two types of Payload disclosures:</strong></p>\n<ul>\n<li>Full Disclosure: Anyone can parse the JWS using base64 and see everything in the payload.</li>\n<li>Complete confidentiality: In the case of JWE, the contents of the JWE payload cannot be seen by anyone other than the owner who has the decryption key.\nHowever, there is no solution for cases where you only want to disclose some information. That is why SD-JWT was born. For example, when an electronic wallet owner purchases a product worth 100,000 yen, they do not need to see the general attribute information (birthday, address, phone number, etc.) that the product seller uses to authenticate the buyer, and they only want to see the buyer's electronic wallet balance.  As a buyer, you can make a purchase by disclosing only essential information such as your balance and ID without disclosing all your personal information. This alone may not be enough, but it is effective to prevent leakage of personal information to a certain extent by disclosing only the necessary information of the owner from the JWS to the business operator.</li>\n</ul>\n<h2>How to implement SD-JWT</h2>\n<p>Let's start with the traditional ID token generation procedure. First, display the personal information of a certain user A in JSON format as shown below.</p>\n<pre><code>{\n  \"sub\": \"cd48414c-381a-4b50-a935-858c1012daf0\",\n  \"given_name\": \"jun\",\n  \"family_name\": \"liang\",\n  \"email\": \"jun.liang@example.com\",\n  \"phone_number\": \"+81-080-123-4567\",\n  \"address\": {\n    \"street_address\": \"123-456\",\n    \"locality\": \"shibuya\",\n    \"region\": \"Tokyo\",\n    \"country\": \"JP\"\n  },\n  \"birthdate\": \"1989-01-01\"\n}\n</code></pre>\n<p>The issuer then assigns an SD-JWT Salt (random value) to each attribute information.</p>\n<pre><code>{\n  \"sd_release\": {\n    \"sub\": \"[\\\"2GLC42sKQveCfGfryNRN9c\\\", \\\"cd48414c-381a-4b50-a935-858c1012daf0\\\"]\",\n    \"given_name\": \"[\\\"eluV5Og3gSNII8EYnsxC_B\\\", \\\"jun\\\"]\",\n    \"family_name\": \"[\\\"6Ij7tM-a5iVPGboS5tmvEA\\\", \\\"liang\\\"]\",\n    \"email\": \"[\\\"eI8ZWm9QnKPpNPeNen3dhQ\\\", \\\"jun.liang@example.com\\\"]\",\n    \"phone_number\": \"[\\\"Qg_O64zqAxe412a108iroA\\\", \\\"+81-080-123-4567\\\"]\",\n    \"address\": \"[\\\"AJx-095VPrpTtM4QMOqROA\\\", {\\\"street_address\\\": \\\"123-456\\\", \\\"locality\\\": \\\"shibuya\\\", \\\"region\\\": \\\"Tokyo\\\", \\\"country\\\": \\\"JP\\\"}]\",\n    \"birthdate\": \"[\\\"Pc33CK2LchcU_lHggv_ufQ\\\", \\\"1989-01-01\\\"]\"\n  }\n}\n</code></pre>\n<p>The attribute information of \"sd_release\" is calculated using the hash function specified in \"_sd_alg\" and stored in \"_sd\" below, and a new payload can be created by adding the issuer's signing key (cnf), validity period (ext), and issuance time (iat). The latest token is issued based on the payload, and the SD-JWT has been created.</p>\n<pre><code>{\n  \"kid\": \"tLD9eT6t2cvfFbpgL0o5j/OooTotmvRIw9kGXREjC7U=\",\n  \"alg\": \"RS256\"\n}.\n{\n  \"_sd\": [\n    \"5nXy0Z3QiEba1V1lJzeKhAOGQXFlKLIWCLlhf_O-cmo\",\n    \"9gZhHAhV7LZnOFZq_q7Fh8rzdqrrNM-hRWsVOlW3nuw\",\n    \"S-JPBSkvqliFv1__thuXt3IzX5B_ZXm4W2qs4BoNFrA\",\n    \"bviw7pWAkbzI078ZNVa_eMZvk0tdPa5w2o9R3Zycjo4\",\n    \"o-LBCDrFF6tC9ew1vAlUmw6Y30CHZF5jOUFhpx5mogI\",\n    \"pzkHIM9sv7oZH6YKDsRqNgFGLpEKIj3c5G6UKaTsAjQ\",\n    \"rnAzCT6DTy4TsX9QCDv2wwAE4Ze20uRigtVNQkA52X0\"\n  ],\n  \"iss\": \"https://example.com/issuer\",\n  \"iat\": 1706075413,\n  \"exp\": 1735689661,\n  \"_sd_alg\": \"sha-256\",\n  \"cnf\": {\n    \"jwk\": {\n      \"kty\": \"EC\",\n      \"crv\": \"P-256\",\n      \"x\": \"SVqB4JcUD6lsfvqMr-OKUNUphdNn64Eay60978ZlL74\",\n      \"y\": \"lf0u0pMj4lGAzZix5u4Cm5CMQIgMNpkwy163wtKYVKI\",\n      \"d\": \"0g5vAEKzugrXaRbgKG0Tj2qJ5lMP4Bezds1_sTybkfk\"\n    }\n  }\n}.\n{\n  Signature\n  The issuer calculates the Payload signature with the public key and places it here, ensuring that the contents of the Payload are not tampered with\n}\n</code></pre>\n<p><strong>The order of the attributes and hash values ​​of \"sd_release\" and \"_sd\" does not need to be maintained.</strong></p>\n<h2>How to use SD-JWT</h2>\n<p>The issuer sends the SD-JWT and \"sd_release\" together to the owner. Depending on the usage situation, the owner can submit the attribute information they want to disclose and the SD-JWT at the same time, allowing authentication while maintaining safety and integrity.</p>\n<pre><code>  \"email\": \"[\\\"eI8ZWm9QnKPpNPeNen3dhQ\\\", \\\"jun.liang@example.com\\\"]\",\n</code></pre>\n<p>If you only want to disclose your e-mail address, you will need to submit the above part together with the SD-JWT. The verifier can check the accuracy of the email by checking the following two points　</p>\n<ul>\n<li>The result of calculating the e-mail portion with the hash function matches <strong>\"5nXy0Z3QiEba1V1lJzeKhAOGQXFlKLIWCLlhf_O-CMO\"</strong> in the \"_sd \" list</li>\n<li>The signature recalculation result of the Payload matches the signature in SD-JWT (the Payload has not been tampered with).</li>\n</ul>\n<h2>Summary</h2>\n<p>By participating in this summit, I was able to understand the history and future development of OpenID. In addition, I learned about SD-JWT, which is a different format from the JWT that the ID team has used so far. There were many interesting discussions, so I recommend participating even if you are not usually involved in the field of ID. I am looking forward to being able to join as a speaker one day representing KINTO Technologies in the future.</p>\n<h1>Reference</h1>\n<p><a href=\"https://www.openid.or.jp/summit/2024/#keynote1\">OpenID Summit Tokyo 2024</a></p>\n"
    },
    {
        "title": "180-degree feedback: Highly recommended!",
        "pubDate": "2024-11-05 10:00:00",
        "link": "https://blog.kinto-technologies.com/posts/2024-07-19-180survey-en/",
        "description": "As part of our team building efforts, we conducted a 180-degree feedback session.",
        "content": "\n<h1>Introduction</h1>\n<p>Hello, I'm Nakaguchi from KINTO Technologies' Mobile App Development Group. I lead the iOS team for the KINTO Kantan Moushikomi App (the “KINTO Easy Application app”), which allows users to customize their car preferences and conveniently submit applications directly from their phones. As part of our team building efforts, we conducted a 180-degree feedback session, and I would like to share here the details of this initiative.\n If you’re interested, please check out <a href=\"https://blog.kinto-technologies.com/posts/2024-04-DD-team-review-meeting/\">this article on our team’s retrospective</a>, which was another initiative carried out by our team.</p>\n<h1>Background</h1>\n<p> Recently, a group of volunteers within our company organized a group reading session <a href=\"https://www.amazon.co.jp/dp/4798179426\">\"GitLab ni manabu sekai saisentan no remote soshiki no tsukurikata: Dokumento no katsuyo de office nashi demo saidai no seika o dasu global kigyo no shikumi\"</a>. You can learn more about this group reading session in <a href=\"https://blog.kinto-technologies.com/posts/2024-04-22-GitLab%E3%81%AB%E5%AD%A6%E3%81%B6%E4%B8%96%E7%95%8C%E6%9C%80%E5%85%88%E7%AB%AF%E3%81%AE%E3%83%AA%E3%83%A2%E3%83%BC%E3%83%88%E7%B5%84%E7%B9%94%E3%81%AE%E3%81%A4%E3%81%8F%E3%82%8A%E3%81%8B%E3%81%9F-%E8%BC%AA%E8%AA%AD%E4%BC%9A/\">Learning from GitLab: How to Create the World's Most Advanced Remote Organization</a>.\n This group reading session was truly inspiring to me, and I wanted to bring some of the insights back to my team. Among the various topics we discussed, I was particularly interested in the concept of 360-degree feedback.\n 360-degree feedback is an evaluation method where an employee receives feedback from multiple perspectives, including colleagues, superiors, and subordinates.\n In general, feedback tends to be given from superiors to subordinates. Personally, I’ve always believed that feedback between colleagues, or from co-workers to supervisors, is equally important. This led me to consider implementing 360-degree feedback within our team.\n However, during the session, we also identified that the 360-degree feedback has potential drawbacks, such as a broad range of respondents and evaluations given to an employee from individuals who may not be directly involved in the employee's work. In counteracting the drawbacks, I learned about the 180-degree feedback method limiting the respondents to just the team members and decided to introduce it to my team.</p>\n<h1>Objectives</h1>\n<p>Through the 180-degree feedback process, I aimed to achieve the following objectives:</p>\n<ul>\n<li>Identify the discrepancy between the roles the team expects each member to fulfill and others each member perceives for themselves.</li>\n<li>Recognize individual strengths and weaknesses, and use these insights for future growth</li>\n<li>Create an opportunity for team members to express their honest opinions about each other.</li>\n<li>Foster team unity by encouraging team members to be considerate of their peers' feelings through the survey process.\nI believed that this 180-degree feedback would be a great opportunity for members to understand each other, thereby improving the quality of relationships within the team.</li>\n</ul>\n<h1>Implementation Method</h1>\n<ul>\n<li>Target members:<ul>\n<li>1 team Leader</li>\n<li>6 engineers</li>\n</ul>\n</li>\n<li>Survey method<ul>\n<li>We conducted an anonymous survey using Microsoft Forms.</li>\n<li>Each member answered the following questions for all other members except themselves:<ol>\n<li>Quantitative evaluation (5-point scale):<ol>\n<li>Questions regarding proactivity </li>\n<li>Questions regarding openness to others </li>\n<li>Questions regarding decision making attitude</li>\n<li>Questions regarding perseverance</li>\n<li>Questions regarding learning from new experiences </li>\n<li>Questions regarding initiative</li>\n</ol>\n</li>\n<li>Qualitative evaluation (free text):<ol>\n<li>Questions regarding self-strengths</li>\n<li>Questions regarding areas for improvement</li>\n<li>Words of appreciation to the target members</li>\n</ol>\n</li>\n</ol>\n</li>\n</ul>\n</li>\n</ul>\n<h3>Considerations to proceed the survey</h3>\n<ul>\n<li>To ensure team members positively engage in the process, we, in advance, shared the background and objectives of the feedback at 1-on-1 meetings.</li>\n<li>To reinforce the anonymity of the survey, we conducted a pre-test survey and shared the results.</li>\n<li>To avoid a low response rate caused by insufficient time to complete the survey, we allocated specific time for its completion.</li>\n<li>As feedbacks may include harsh or negative comments about target members, we added a question to allow respondents to express their gratitude to the others at the end of the survey. (This helps to end the survey on a positive note and makes it easier for recipients to accept the feedback constructively.)</li>\n<li>As a team leader, I wanted to show my team members that I am open-minded to share my feedback results, including self-improvement areas, with them. (However, I did not pressure the team members to share their own feedback results.)</li>\n</ul>\n<h1>Summary of My Feedback Results</h1>\n<p>I have summarized my feedback results below.</p>\n<h3>Strengths</h3>\n<ul>\n<li>High communication skills and approachability: for example, I actively participate in meetings and make an effort to explain things clearly.</li>\n<li>Eagerness to learn and share knowledge with others: I consistently stay updated on new technology trends and share this information through Slack and meetings.</li>\n<li>Efforts to improve teamwork: I regularly organize team events to strengthen the bonds among team members.</li>\n<li>Strong information-gathering skills and quick response: I promptly address issues as they arise and communicate accurate information to relevant parties.</li>\n<li>Compassionate and reliable leader: I listen to any concerns from team members and appropriately provide them with advice.</li>\n</ul>\n<h3>Areas for Improvement</h3>\n<ul>\n<li>Understanding of product specifications: at times, I proceed with development without fully understanding the specifications of the features.</li>\n<li>Improvement to organize task tickets more frequently: the prioritization of tickets is sometimes insufficient, which causes important tasks to be delayed.</li>\n<li>Improvement to clearly explain the background and purpose of implementing initiatives: insufficient communication leaves the purpose of some initiatives unclear, resulting in a lack of understanding among team members.</li>\n<li>Improvement to take more risks: I may be too cautious when approaching new initiatives, which can result in missed opportunities.\n My feedback results showed that the areas I consciously focus on were recognized as strengths, which was very pleasing. On the other hand, the feedback on areas for improvement allowed me to recognize not only the aspects I was aware of but also those I had not realized. This feedback will help me grow further.\nAdditionally, the words of appreciation from team members at the end boosted my motivation significantly. I am committed to continuing to contribute to the team even more in the future.</li>\n</ul>\n<h1>Team Strengths and Areas for Improvement Identified Through 180-degree Feedback</h1>\n<p>I also summarized the feedback as an overall team.</p>\n<h3>Team strength</h3>\n<ul>\n<li>\n<strong>Diverse technical skills and leadership</strong>: each member has strong technical skills and leadership abilities.</li>\n<li>\n<strong>Communication skills</strong>: communication within the team is active, and information is shared effectively.</li>\n<li>\n<strong>Problem-solving ability</strong>: the team actively tackles technical challenges and complex tasks.</li>\n<li>\n<strong>Learning motivation</strong>: there is a strong commitment to acquiring new knowledge and technical skills, leading to continuous growth.</li>\n</ul>\n<h3>Areas for improvement for the entire team</h3>\n<ul>\n<li>\n<strong>Improving information sharing efficiency</strong>: finding more efficient ways to share new technical skills and project-related information.</li>\n<li>\n<strong>Clarifying roles and responsibilities</strong>: further clarifying roles and responsibilities to fully leverage each team member’s abilities.</li>\n<li>\n<strong>Developing a broader perspective</strong>: emphasizing the importance of sharing the project’s overall vision and objectives among the team members.</li>\n<li>\n<strong>Technical skill sharing and knowledge management</strong>: promoting the cross-sharing of technical knowledge within the team to enhance the skills of all members.\nAdditionally, I have summarized each team member’s strengths and roles in the diagram below.\n<img src=\"https://blog.kinto-technologies.com/assets/blog/authors/nakaguchi/2024-07-DD-180survey/team.png\" alt=\"\">\n</li>\n</ul>\n<h1>Post-Retrospective Survey</h1>\n<p>After conducting the 180-degree feedback, we carried out a survey to gather feedback on the process. (out of 7 responses).</p>\n<ul>\n<li>Change in evaluation<ul>\n<li>Before: 7.29 -&gt; After: 9.19</li>\n</ul>\n</li>\n<li>NPS <a href=\"https://www.nttcoms.com/service/nps/summary/\">(What is NPS?)</a><ul>\n<li>57</li>\n</ul>\n</li>\n<li>Would you like to conduct 180-degree feedback on a regular basis (e.g. every six months)?<ul>\n<li>86% answered “Yes”</li>\n</ul>\n</li>\n<li>AI summary of \"How satisfied did you feel after you participated?\" (free text)</li>\n</ul>\n<pre><code>The survey results indicate that respondents felt they gained a deeper self-awareness and were able to identify their own challenges.\nAdditionally, through feedback from others, they were able to gain new perspectives that they might not have noticed otherwise.\nBy receiving specific evaluations and areas for improvement, they felt that their future course of action become clearer.\nThese results suggest that the survey was an effective tool for self-reflection.\n</code></pre>\n<h1>Conclusion</h1>\n<p>In conducting the 180-degree feedback, we encountered a few operational challenges.</p>\n<ul>\n<li>The average scores were generally high, making it difficult to differentiate between responses.</li>\n<li>The timing coincided with changes in team members, which resulted in failing to provide feedback to certain team members in an appropriate manner.\nHowever, overall, I felt that the feedback process was well-received and satisfying for the team, including myself. As evidenced by the survey results, the team members are highly interested in continuing this process regularly, and I plan to carry on with these efforts in the future.\nThrough this feedback, I was able to identify areas for improvement both for myself and the team as a whole, which I intend to leverage for future growth. I also hope that each team members can also recognize their own areas for improvement and use this as an opportunity for growth.</li>\n</ul>\n"
    },
    {
        "title": "KINTO Technologies Will Be a Gold Sponsor of iOSDC Japan 2024 &amp; The Challenge Token is Here 🚙",
        "pubDate": "2024-11-04 10:00:00",
        "link": "https://blog.kinto-technologies.com/posts/sponsored-iosdc-japan-2024-en/",
        "description": "\n<h1>🎉 We Are Going to Be a Gold Sponsor for iOSDC Japan 2024</h1>\n<p>Hello! The Obon season is just around the corner now, right? I am planning to take my children someplace fun this year. Hiroya <a href=\"https://x.com/TRAsh___\">(@___TRAsh) </a> here. Well, this time, I have some news from the iOS team.\nKINTO Technologies is going to be a Gold Sponsor for iOSDC Japan 2024 🙌\niOSDC Japan 2024 will be our first participation as exhibitors, and we are going to hold a coding quiz. We are also planning to hand out novelty goods, so please do come visit our booth!\nSo, seeing as it was such a great opportunity, for this article, I interviewed some of our iOS team members. I hope it will be interesting for you to see the diverse range of members we have.</p>\n<h2>🎤 The interviews</h2>\n<p>This time, I interviewed the KINTO Unlimited iOS team. KINTO Unlimited is an international team with lots of members from overseas. Daily work is primarily conducted in English, though most of them also speak Japanese.</p>\n<h3>T.O.</h3>\n<p>—Please briefly introduce yourself.\nHello. I am T.O.\nI am an iOS engineer at KINTO Technologies. I worked on web front-end development up to my previous job, and had never done any mobile development until I came here, or used GitHub either. I have been with the company for about two and a half years now, during which time I have been involved in a variety of projects and learned about a variety of architectures and modern development methods.</p>\n<p>—What changed for you after joining this company?\nAcquiring the skills needed to be an iOS engineer. Also, I moved to Tokyo when I joined KINTO Technologies, so my living environment changed as well. Back then, there were not that many people out and about due to the COVID-19 pandemic, and seeing giant pandas for the first time in Ueno Park left a big impression on me.</p>\n<p>—What do you like about this company?\nThe atmosphere makes it extremely easy to talk to people. You can consult colleagues about both private and technical matters without hesitation. It is a real blessing to be able to feel free to talk to people whether I am in the office or working remotely. Another good thing is how the benefits package has plenty of things that are really helpful for the parenting generation.</p>\n<p>—What challenges do you want to take on in the future?\nIn the future, I want to do development using AR and ML. I am working on a project that relates to those fields at the moment, so I want to get into them even further. Also, I want to play games with my children.</p>\n<p>—A few final words for the blog, please!\nYou can work in a wide range of ways, so it is a very accommodating company to work for 👍</p>\n<h3>V.V.</h3>\n<p>—Please briefly introduce yourself.\nI am a Russian who was born and raised in Russia, and have  around eight years of experience in iOS development. My hobbies are TRPGs and being a parent. My previous work included creating Windows desktop apps in Russia and ambulance-related services in the United States. Then after coming to Japan, I worked for another company for several years before joining KINTO Technologies.</p>\n<p>—What changed for you after joining this company?\nUp to then, I had always worked for small companies, so I always felt uneasy on account of being a parent. On the other hand, KINTO Technologies is a Toyota Group company, so I can work free from worry. The basic salary is not all that different, but there are lots of extra allowances, so I think my pay has gotten quite a lot better. I was able to get a double bed with my bonus.</p>\n<p>—What do you like about this company?\nPreviously, I had always worked in small teams, so there was no one to turn to for technical advice or mentoring. In KINTO Technologies, however, it is easy to discuss technical matters. Also, I get opportunities to share my own knowledge and there are lots of highly experienced team members around, too, so it is very stimulating.</p>\n<p>—What challenges do you want to take on in the future?\nI am interested in developing AR and ML functionalities, so I want to delve into those more deeply. I also want to support my family thoroughly.\n—A few final words for the blog, please!\nCome join us here, because you will find lots of opportunity to grow ✋</p>\n<h3>S.C.</h3>\n<p>—Please give us a brief introduction of yourself.\nI am a Canadian who was born in Korea then moved to Canada, and is now living in Japan. I came to Japan because I was interested in Japanese movies and culture, and had lots of friends from here. I have been here for around 10 years now. In my previous job, I also worked on back-end development. I am currently the leader of the KINTO Unlimited iOS team.</p>\n<p>—What changed for you after joining this company?\nIt is a group where lots of mobile engineers get involved regardless of the project, so it is easy to improve skills that have an iOS development focus. I am also glad to be spending more time working in Japanese.</p>\n<p>—What do you like about this company?\nIn my previous job, the system was huge and I was pretty much doing maintenance work, but in KINTO Technologies, I frequently develop new functionalities, and get lots of opportunities to learn about new technologies. Another great thing is how easy it is to incorporate modern technologies. Also, I love how we actively hold study sessions, giving us lots of opportunities to share our knowledge.</p>\n<p>—What challenges do you want to take on in the future?\nI just became a team leader, so I want to improve my leadership skills. I am also interested in how the implementation approaches vary depending on the OS, so I want to expand my knowledge of Android as well. Also, I am currently going to grad school, so I want to graduate from that.</p>\n<p>—A few final words for the blog, please!\nI am in a modern development environment where I get to experience a wide variety of things that I never had any chance to before, so I am having a great time. 👍</p>\n<h2>🚙 Summary</h2>\n<p>Our company is still growing, but there are many products that have only just gotten started, so it is a development environment where it is easy to incorporate modern methods. We get to work in diverse teams, so we get a lot of opportunities to learn about new cultures and technologies. If you want to work in an environment like that, please apply to join us!\n<a href=\"https://www.kinto-technologies.com/recruit/\">https://www.kinto-technologies.com/recruit/</a></p>\n<p>And on that note...</p>\n<p>:::message\nThe Challenge Token is here!\n#KTCでAfterPartyやります\n:::</p>\n<p>On Monday, September 9, we are going to hold iOSDC JAPAN 2024 AFTER PARTY jointly with TimeTree and WealthNavi, marking our first-ever three-company collaboration event with them. 🥳** The place will be our office in Nihonbashi Muromachi. 🗺️ Please do come along to this, too!</p>\n<p><a href=\"https://kinto-technologies.connpass.com/event/327743/\">https://kinto-technologies.connpass.com/event/327743/</a></p>\n<p>It will probably be extremely hot on the day. Please keep yourselves thoroughly hydrated while you are enjoying the event! We are looking forward to seeing you all at our booth ✋</p>\n",
        "content": "\n<h1>🎉 We Are Going to Be a Gold Sponsor for iOSDC Japan 2024</h1>\n<p>Hello! The Obon season is just around the corner now, right? I am planning to take my children someplace fun this year. Hiroya <a href=\"https://x.com/TRAsh___\">(@___TRAsh) </a> here. Well, this time, I have some news from the iOS team.\nKINTO Technologies is going to be a Gold Sponsor for iOSDC Japan 2024 🙌\niOSDC Japan 2024 will be our first participation as exhibitors, and we are going to hold a coding quiz. We are also planning to hand out novelty goods, so please do come visit our booth!\nSo, seeing as it was such a great opportunity, for this article, I interviewed some of our iOS team members. I hope it will be interesting for you to see the diverse range of members we have.</p>\n<h2>🎤 The interviews</h2>\n<p>This time, I interviewed the KINTO Unlimited iOS team. KINTO Unlimited is an international team with lots of members from overseas. Daily work is primarily conducted in English, though most of them also speak Japanese.</p>\n<h3>T.O.</h3>\n<p>—Please briefly introduce yourself.\nHello. I am T.O.\nI am an iOS engineer at KINTO Technologies. I worked on web front-end development up to my previous job, and had never done any mobile development until I came here, or used GitHub either. I have been with the company for about two and a half years now, during which time I have been involved in a variety of projects and learned about a variety of architectures and modern development methods.</p>\n<p>—What changed for you after joining this company?\nAcquiring the skills needed to be an iOS engineer. Also, I moved to Tokyo when I joined KINTO Technologies, so my living environment changed as well. Back then, there were not that many people out and about due to the COVID-19 pandemic, and seeing giant pandas for the first time in Ueno Park left a big impression on me.</p>\n<p>—What do you like about this company?\nThe atmosphere makes it extremely easy to talk to people. You can consult colleagues about both private and technical matters without hesitation. It is a real blessing to be able to feel free to talk to people whether I am in the office or working remotely. Another good thing is how the benefits package has plenty of things that are really helpful for the parenting generation.</p>\n<p>—What challenges do you want to take on in the future?\nIn the future, I want to do development using AR and ML. I am working on a project that relates to those fields at the moment, so I want to get into them even further. Also, I want to play games with my children.</p>\n<p>—A few final words for the blog, please!\nYou can work in a wide range of ways, so it is a very accommodating company to work for 👍</p>\n<h3>V.V.</h3>\n<p>—Please briefly introduce yourself.\nI am a Russian who was born and raised in Russia, and have  around eight years of experience in iOS development. My hobbies are TRPGs and being a parent. My previous work included creating Windows desktop apps in Russia and ambulance-related services in the United States. Then after coming to Japan, I worked for another company for several years before joining KINTO Technologies.</p>\n<p>—What changed for you after joining this company?\nUp to then, I had always worked for small companies, so I always felt uneasy on account of being a parent. On the other hand, KINTO Technologies is a Toyota Group company, so I can work free from worry. The basic salary is not all that different, but there are lots of extra allowances, so I think my pay has gotten quite a lot better. I was able to get a double bed with my bonus.</p>\n<p>—What do you like about this company?\nPreviously, I had always worked in small teams, so there was no one to turn to for technical advice or mentoring. In KINTO Technologies, however, it is easy to discuss technical matters. Also, I get opportunities to share my own knowledge and there are lots of highly experienced team members around, too, so it is very stimulating.</p>\n<p>—What challenges do you want to take on in the future?\nI am interested in developing AR and ML functionalities, so I want to delve into those more deeply. I also want to support my family thoroughly.\n—A few final words for the blog, please!\nCome join us here, because you will find lots of opportunity to grow ✋</p>\n<h3>S.C.</h3>\n<p>—Please give us a brief introduction of yourself.\nI am a Canadian who was born in Korea then moved to Canada, and is now living in Japan. I came to Japan because I was interested in Japanese movies and culture, and had lots of friends from here. I have been here for around 10 years now. In my previous job, I also worked on back-end development. I am currently the leader of the KINTO Unlimited iOS team.</p>\n<p>—What changed for you after joining this company?\nIt is a group where lots of mobile engineers get involved regardless of the project, so it is easy to improve skills that have an iOS development focus. I am also glad to be spending more time working in Japanese.</p>\n<p>—What do you like about this company?\nIn my previous job, the system was huge and I was pretty much doing maintenance work, but in KINTO Technologies, I frequently develop new functionalities, and get lots of opportunities to learn about new technologies. Another great thing is how easy it is to incorporate modern technologies. Also, I love how we actively hold study sessions, giving us lots of opportunities to share our knowledge.</p>\n<p>—What challenges do you want to take on in the future?\nI just became a team leader, so I want to improve my leadership skills. I am also interested in how the implementation approaches vary depending on the OS, so I want to expand my knowledge of Android as well. Also, I am currently going to grad school, so I want to graduate from that.</p>\n<p>—A few final words for the blog, please!\nI am in a modern development environment where I get to experience a wide variety of things that I never had any chance to before, so I am having a great time. 👍</p>\n<h2>🚙 Summary</h2>\n<p>Our company is still growing, but there are many products that have only just gotten started, so it is a development environment where it is easy to incorporate modern methods. We get to work in diverse teams, so we get a lot of opportunities to learn about new cultures and technologies. If you want to work in an environment like that, please apply to join us!\n<a href=\"https://www.kinto-technologies.com/recruit/\">https://www.kinto-technologies.com/recruit/</a></p>\n<p>And on that note...</p>\n<p>:::message\nThe Challenge Token is here!\n#KTCでAfterPartyやります\n:::</p>\n<p>On Monday, September 9, we are going to hold iOSDC JAPAN 2024 AFTER PARTY jointly with TimeTree and WealthNavi, marking our first-ever three-company collaboration event with them. 🥳** The place will be our office in Nihonbashi Muromachi. 🗺️ Please do come along to this, too!</p>\n<p><a href=\"https://kinto-technologies.connpass.com/event/327743/\">https://kinto-technologies.connpass.com/event/327743/</a></p>\n<p>It will probably be extremely hot on the day. Please keep yourselves thoroughly hydrated while you are enjoying the event! We are looking forward to seeing you all at our booth ✋</p>\n"
    },
    {
        "title": "Participation Report of the 28th Shirahama Symposium on Cybercrime",
        "pubDate": "2024-11-01 10:00:00",
        "link": "https://blog.kinto-technologies.com/posts/2024-08-13-Shirahama2024-en/",
        "description": "Sharing my experience at the 28th Shirahama Cyber Crime Symposium, held from July 4 to 6.",
        "content": "\n<h1>Introduction</h1>\n<p>Hello, this is Kuwahara @Osaka Tech Lab from the SCoE Group of KINTO Technologies (hereinafter referred to as KTC).<br>\nSCoE is an abbreviation for Security Center of Excellence, which may not be a familiar term to you yet. At KTC, we restructured our CCoE team into the SCoE Group this past April. To find out more about the SCoE Group, please check our article <a href=\"https://blog.kinto-technologies.com/posts/2024-05-13-SCoE/\">“SCoE Group: Leading the Evolution of Cloud Security.”</a><br>\nTo find out more about the Osaka Tech Lab (KTC’s Kansai base), see <a href=\"https://blog.kinto-technologies.com/posts/2023-06-01-OsakaTechLab%E7%B4%B9%E4%BB%8B/\">“Introducing the Osaka Tech Lab.”</a><br></p>\n<p>In this blog, we will provide a report on our participation in the 28th Shirahama Symposium on Cybercrime, which was held from July 4th to 6th, 2024.<br><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/DKuwahara/Shirahama2024/img_Outside_venue.jpg\" alt=\"\">\nFirst of all, for those who are not familiar with the place \"Shirahama\"<br></p>\n<p>Shirahama refers to a town located in the Nishimuro District of Wakayama Prefecture. It’s a picturesque tourist destination, known for its stunning ocean views, beautiful beaches, and relaxing hot springs. Shirahama is also home to Adventure World, which houses the largest number of pandas in Japan, with four pandas in total.<br>\nI imagine that the symposium participants not only deepened their knowledge of cybersecurity but also enjoyed the many attractions of Shirahama.\n<br></p>\n<h1>Symposium Overview</h1>\n<p>The theme was “How can we address the rapidly changing environment and the increasing complexity of cybercrime?”\nAlthough the event was mainly focused on cybercrime, it also included talks and panel discussions on recent general security threats and emerging topics. Based on the philosophy that \"cybersecurity cannot be protected by a single organization,\" this symposium values ​​horizontal connections between companies, government agencies, educational institutions, and other organizations. As a result, I got to hear a lot of ideas and opinions directly from the source, that you could only be gained by being present at the event.\nThe daytime session was held at the <a href=\"http://www.big-u.jp/\">Wakayama Prefectural Information Exchange Center Big U</a>, while the evening session shifted to <a href=\"https://www.keyterrace.co.jp/\">Hotel Seamore</a>, located about 8 km away (I won’t delve into the fact that the daytime venue is technically in neighboring Tanabe City rather than Shirahama Town.)</p>\n<p><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/DKuwahara/Shirahama2024/img_Inside_venue.jpg\" alt=\"\"></p>\n<p>There were numerous interesting talks and presentations at the symposium, but I will highlight two key topics that left a lasting impression on me. For a full program listing, please check out the <a href=\"https://sccs-jp.org/symposium28/program/\">official website.</a></p>\n<h1>Key topic 1: Cross-organizational collaboration</h1>\n<p>Networking is regarded as extremely important in these symposiums. The greeting address from the symposium organizing committee leader and several speakers emphasized that no single company or organization can effectively counter threats alone. They highlighted the importance of defending against threats in a holistic, surface-level approach rather than a fragmented, point-based one. This highlights the necessity of collaboration that transcends the boundaries of different industries, as well as the public, private, and academic sectors, to address the complexities and diversities of cyberattacks. It is important to have a common understanding that information sharing between companies, collaboration with government agencies and police agencies, and cooperation with educational institutions are key to achieving stronger security measures.\nMany police representatives also participated and exchanged views with individuals from private companies. In fact, the first person to invite me to exchange business cards at the symposium was a representative from a police force in a certain prefecture.\nIt was also emphasized that it is difficult for a company to deal with security incidents on its own, and that it is important for each organization to share their experience and know-how and implement effective security measures.<br></p>\n<p>During the evening's BOF (Birds of a Feather) event, participants with the same concerns from across organizations and industries gathered and engaged in a lively exchange of opinions.</p>\n<h1>Key topic 2: Generative AI and security</h1>\n<p>There were several talks that covered the trend of generative AI security. The most impressive one was the talk by Fujitsu Laboratories, who provided the latest trends and practical knowledge on generative AI security. \nThe presentation by Fujitsu Laboratories emphasized the importance of addressing security in two ways, protecting systems with AI and ensuring the security of AI itself.</p>\n<ul>\n<li>\n<strong>Protect with AI</strong>:<ul>\n<li>AI as a Cybersecurity Defense</li>\n<li>AI to prevent security incidents\nIn the field of protection through AI, the existing security coverage is expanding massively as a result of being able to use generative AI as a means of protection. Fujitsu Laboratories introduced their efforts to expand security AI components and create a DevSecOps framework.</li>\n</ul>\n</li>\n<li>\n<strong>Protecting AI</strong>:<ul>\n<li>Threats and attacks against AI</li>\n<li>Protecting AI from attacks\nIn the \"Protecting AI\" section, the risks posed by generative AI were explained in detail.  Specific methods of cyber attacks against generative AI and countermeasure approaches were also mentioned. Attacks against AI, including \"stealing information\" and \"deceiving AI,\" were introduced with concrete examples.\nThe talk was very informative, as it systematically summarized the security aspects that should be considered when building products that utilize generative AI.Brazil  For instance, we received useful input for formulating security guidelines for the generative AI development process, as well as examples of guardrails and vulnerability scanners, which will be useful in creating concrete guidelines.</li>\n</ul>\n</li>\n</ul>\n<h1>TIPS for those attending next year</h1>\n<p>Here are some tips for those who will be attending next year.</p>\n<ul>\n<li>\n<strong>Securing tickets</strong>: The hot spring symposiums (Dogo, Echigo Yuzawa, Atami, Kyushu), including this Shirahama Symposium, are very popular and have platinum ticket prices. Be sure to check the sales start date and secure your tickets early. I also recommend buying lunch (bento) tickets as well. This is due to the limited number of lunch options available in and around the venue.</li>\n<li>\n<strong>Securing means of transportation</strong>: There is a shuttle bus provided by the symposium from Shirahama Station to the venue, but the time is not flexible.  It is difficult to get to the venue by public transportation, so you need to be careful about the shuttle bus times.  Renting a car is also an option. (I got permission from my company to attend by car, which was really helpful.)</li>\n<li>\n<strong>Choosing your accommodation</strong>: Considering the shuttle bus, it is convenient to choose a place to stay close to the venue (hotel) for the night. The area around the venue for the night is a hot spring resort, so there are many accommodations.</li>\n<li>\n<strong>Networking</strong>: It is advisable to bring plenty of business cards. This is a networking-oriented symposium, so the more you interact with others, the more you'll gain.</li>\n</ul>\n<h1>Summary</h1>\n<p>In cybersecurity, connections across organizations and industries are important. The “straight from the horse’s mouth” ideas, opinions, etc. that you can only get to hear by actually being there are truly invaluable. I am very grateful to the organizing committee members, speakers, sponsors, and all other participants for making the symposium so worthwhile.<br>\nNext year, how about immersing yourselves in cybersecurity while admiring the beautiful Shirahama sunset as well?\n<img src=\"https://blog.kinto-technologies.com/assets/blog/authors/DKuwahara/Shirahama2024/img_Sunset_in_Shirahama.jpg\" alt=\"\"></p>\n<h1>Finally</h1>\n<p>The SCoE Group I belong to is seeking new team members to join us. We welcome both those with practical experience in cloud security and those who are interested but have no experience. Please feel free to contact us.<br>\nFor additional details, <a href=\"https://hrmos.co/pages/kinto-technologies/jobs/1811937538128224276\">please check here.</a></p>\n"
    },
    {
        "title": "JSConf JP 2024のプレミアムスポンサーを務めます",
        "pubDate": "2024-11-01 10:00:00",
        "link": "https://blog.kinto-technologies.com/posts/2024-11-01-JSConfJP/",
        "description": "JSConf JP 2024のプレミアムスポンサーを務めます",
        "content": "\n<h1>はじめに</h1>\n<p>こんにちは！\n<a href=\"https://up.kinto-jp.com/\">KINTO ONE(中古車)</a>のフロントエンド開発をしていますRen.Mです。</p>\n<p>この度、KINTOテクノロジーズ株式会社は2024年11月23日（土）に九段下坂上KSビルにて開催される「<a href=\"https://jsconf.jp/2024/\">JSConf JP 2024</a>」のプレミアムスポンサーを務めます。</p>\n<p>■JSConf JP 2024について\nJSConf JP 2024は、日本Node.js協会が主催する日本のJavaScriptフェスティバルです。\n日本でのJSConfの開催は今回で5回目となります。</p>\n<h1>スポンサーブース</h1>\n<p>ブースではJavaScriptにまつわるアンケートを用意しています！\n回答いただけた方にはガチャガチャを回していただき、オリジナルノベルティをプレゼントします！\n写真はノベルティの一部です！\n<img src=\"https://blog.kinto-technologies.com/assets/blog/authors/Ren.M/JSConf/PaperClip.webp\" alt=\"紙クリップ\" title=\"紙クリップ\"><em>紙クリップ</em></p>\n<p><img src=\"https://blog.kinto-technologies.com/assets/blog/authors/Ren.M/JSConf/ToteBags.webp\" alt=\"トートバッグ\" title=\"トートバッグ\"><em>トートバッグ</em></p>\n<h1>スポンサーワークショップ</h1>\n<p>ワークショップでは「クルマのサブスクサービスをNext.jsで内製化した経験とその1年後（仮）」について発表します！詳細は以下のリンクからご確認ください！\n<a href=\"https://jsconf.jp/2024/talk/kinto-technologies/\">https://jsconf.jp/2024/talk/kinto-technologies/</a></p>\n<h1>We Are Hiring！</h1>\n<p>KINTOテクノロジーズでは一緒に働く仲間を探しています！\nまずは気軽にカジュアル面談からの対応も可能です。少しでも興味のある方は以下のリンクからご応募ください！\n<a href=\"https://hrmos.co/pages/kinto-technologies/jobs/1955878275904303141\">https://hrmos.co/pages/kinto-technologies/jobs/1955878275904303141</a></p>\n<h1>おわりに</h1>\n<p>興味をお持ちの方はぜひブース、ワークショップまでお越しください！\n当日みなさまに会場でお会いできるのを楽しみしています！</p>\n"
    },
    {
        "title": "Let’s Use the Functions of Figma Variables! (For Beginners – Part 2)",
        "pubDate": "2024-10-31 10:00:00",
        "link": "https://blog.kinto-technologies.com/posts/2024-06-03-figma2-en/",
        "description": "Let’s Use the Functions of Figma Variables! (For Beginners – Part 2)",
        "content": "\n<p>​</p>\n<h1>Introduction</h1>\n<p>Previously in Part 1, I covered the basics of using variables, adjusting product quantities, and setting subtotals.\nIn this article, I’ll continue from where we left off and explain how to increase the number of items in the cart to two, set a subtotal, establish free shipping conditions, calculate the total amount, and modify the message displayed when free shipping is applied.</p>\n<h1>Let's Make a Shopping Cart Mock-Up Using the Functions of Figma Variables! Part 2</h1>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/1.webp =300x) <em>Final layout of the shopping cart</em>\n</td>\n</tr></tbody>\n</table>\n<h3>[Part 1]</h3>\n<ol>\n<li>What Are Variables</li>\n<li>Part Creation</li>\n<li>First Is the Count-Up Function</li>\n<li>How To Create and Assign Variables</li>\n<li>Creating a Count-Up Function</li>\n<li>Subtotal Settings</li>\n</ol>\n<h3>[Part 2]</h3>\n<ol>\n<li>Increasing the Number of Products to Two</li>\n<li>Subtotal Settings</li>\n<li>Free Shipping Settings</li>\n<li>Total Settings</li>\n<li>Changing the Wording to “Free Shipping”</li>\n<li>Completed</li>\n</ol>\n<h3>Increasing the Number of Products to Two</h3>\n<p>To have two items in the cart, start by copying the product information from Part 1. Then, update the product images, names, prices, and the quantity displayed in the cart. (Of course, you can also add products using the component variant function for duplication.)</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/2.webp =300x) <em>Duplicate the original product, and while doing so, change the product name, product image, and price</em>\n</td>\n</tr></tbody>\n</table>\n<p>In the following explanation, the original product (SPECIAL ORIGINAL BLEND) will be referred to as \"Product A\" and the newly copied and added product (BLUE MOUNTAIN BLEND) will be referred to as \"Product B\".\nAdditionally, just like with Product A, assign the variable “Kosu2” to the quantity of Product B. Refer to Part 1 to set up the count-up function for the plus and minus buttons of Product B.</p>\n<h3>Subtotal Settings</h3>\n<p>This is an application of the subtotal settings made in Part 1.</p>\n<h3>Create and Assign a Variable</h3>\n<p>In Part 2, we assume that the cart contains two products, Product A and Product B, each with a quantity of one. Consequently, we update the value of the local variable ‘Shoukei’ to the total amount of ¥250, calculated as follows: Product A (¥100 x 1) + Product B (¥150 x 1). When you make this change, any numbers on your canvas linked to this variable will automatically update to reflect the new total amount.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/3.webp =300x) <em>List of local variables. The red box is the variable assigned to the subtotal number.</em>\n</td>\n</tr></tbody>\n</table>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/4.webp =300x) <em>The subtotal is reflecting the value of the local variable \"Shoukei\".</em>\n</td>\n</tr></tbody>\n</table>\n<h3>Give an Action to the Button</h3>\n<p>In Part 1, the subtotal was calculated based on the total amount of Product A only, as shown in the figure below. Select the variable \"Shoukei\" that you want to update when you click on the plus or minus button for Product A. Then, enter the value of the variable \"Kosu1\" (which represents the number of items) multiplied by 100 (the unit price of Product A) as the formula to indicate what happens at that time.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/5.webp =300x) <em>The subtotal formula set in Part 1</em>\n</td>\n</tr></tbody>\n</table>\n<p>Following this basic principle, we will set the formula to the plus and minus buttons for Products A and B as shown below so that the subtotal will be the sum of the quantities of Products A and B.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/6.webp =300x) <em>Settings for the plus button of Product A. The area surrounded by the dotted line is the subtotal setting range. The solid red box shows Product A on the left and Product B on the right.</em>\n</td>\n</tr></tbody>\n</table>\n<p>This setting will make the subtotal to be calculated and updated each time you press the plus and minus buttons. By trying the button operation on the preview screen, you can see that the subtotal correctly reflects the total price of the two items.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/7.gif =300x)</td>\n</tr></tbody>\n</table>\n<h3>Setting up free shipping</h3>\n<p>Next, I will explain how to set up \"Free shipping on purchases over ¥1,000!\" The shipping conditions to be set are as follows:</p>\n<ol>\n<li>If the total is less than ¥1,000, a shipping fee of ¥500 will be added. </li>\n<li>If the total amount is more than ¥1,000, shipping is free.</li>\n</ol>\n<h3>Create and Assign a Variable</h3>\n<p>First, assign a variable to the number that represents the shipping fee. In this mockup, the initial cart contains one item each, the subtotal is ¥250, and the shipping fee is ¥500. Therefore, we will name the newly created variable “Shipping”, set its value to 500, and assign it to the number next to the shipping fee.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/8.webp =300x) <em>The variable \"Shipping\" is assigned to the number next to the shipping fee</em>\n</td>\n</tr></tbody>\n</table>\n<h3>Give an Action to the Button</h3>\n<p>Next, set up the button action to calculate the subtotal. The shipping fee will depend on whether the subtotal is less than ¥1,000 or not, so we will use an if statement. If the subtotal is less than ¥1,000, the shipping fee is ¥500, which can be expressed as follows:</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/9.webp =300x)</td>\n</tr></tbody>\n</table>\n<p>This formula means that if the subtotal is less than ¥1,000 then the value of \"Shipping\" should be 500.\nBy the way, you may wonder why we need to enter the same value in \"Shipping\" because we originally set the value to 500. However, this setting ensures that after the subtotal becomes ¥1,000 or more and the shipping fee is set to ¥0, if the subtotal becomes less than ¥1,000 again, the shipping fee will be reset from ¥0 to ¥500.\nNext, if the subtotal is ¥1,000 or more, the shipping fee will be ¥0. This can be expressed as shown in the red box below.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/10.webp =300x)</td>\n</tr></tbody>\n</table>\n<p>This means that if the subtotal is ¥1,000 or more, the “Shipping” will be set to 0.\nBy the way, \"else\" refers to any case that does not meet the conditions set by \"if\". In this case, \"if\" refers to when the subtotal is less than ¥1,000, so that means \"else\" covers when the subtotal is ¥1,000 or more.\nAfter applying these settings to each button and previewing it, you will see that the shipping fee changes to \"¥0\" once the subtotal exceeds ¥1,000. By setting it up this way, the shipping fee will be automatically adjusted according to the subtotal amount.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/11.webp =300x) <em>Shipping fee will be ¥0 if the subtotal exceeds ¥1,000</em>\n</td>\n</tr></tbody>\n</table>\n<h3>Total Settings</h3>\n<p>Next, let’s move on to setting the total amount.</p>\n<h3>Create and Assign a Variable</h3>\n<p>The variable that indicates the total amount will be abbreviated as \"T_Am\" for \"Total Amount\". I apologize for repeating myself, but in this mockup, we assume that the cart contains one of each product, A and B, with a subtotal of ¥250 and a shipping fee of ¥500. Therefore, we will set the initial total amount to 750 for \"T_Am\".\nBy assigning the variable \"T_Am\" to the number indicating the total amount, the value \"750\" will be displayed.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/12.webp =300x) <em>The variable is assigned to total amount</em>\n</td>\n</tr></tbody>\n</table>\n<h3>Give an Action to the Button</h3>\n<p>For the total amount, you will also need to set a conditional branch based on whether the subtotal is less than ¥1,000 or not. The conditions will be the same as the shipping fee settings, so we will add the necessary actions.\nWhen you hover your mouse over the if statement, a \"+\" button will appear with the text \"Add nested action.\" And if you click this button, then a space for additional settings will appear. If you want to add multiple actions under one condition, you can add them in this way:</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/13.webp =300x)</td>\n</tr></tbody>\n</table>\n<p>If the subtotal is less than ¥1,000, the total amount will be subtotal + shipping fee, as shown in the red box below.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/14.webp =300x)</td>\n</tr></tbody>\n</table>\n<p>On the other hand, if the subtotal is ¥1,000 or more, the total amount will be the subtotal (with a shipping fee of ¥0) as shown in the red box below. Please note that this is within the \"else\" statement.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/15.webp =300x)</td>\n</tr></tbody>\n</table>\n<p>After applying the settings to each button and previewing them, you will see that when the subtotal reaches ¥1,000, the shipping fee becomes ¥0 and this change is reflected in the total amount.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/16.webp =300x)</td>\n</tr></tbody>\n</table>\n<h3>Modifying the text “free shipping”</h3>\n<p>Finally, we will make some changes to the free shipping text. Here, we would like to hide the \"free shipping\" text (boxed in red) under the header when shipping becomes free.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/17.webp =300x)</td>\n</tr></tbody>\n</table>\n<h3>Create and Assign a Variable</h3>\n<p>Boolean variables are often used when switching between show/hide. A Boolean is a data type used to represent binary conditions such as \"true/false\" or \"yes/no.\" By the way, in cases like this when we switch between show/hide states, Figma automatically sets \"true\" as shown and \"false\" as hidden, so we will use these default settings.\nFirst, open Local Variables and press the Create Variable button. Select \"Boolean\" as the data type. Since this variable is related to the shipping text, we named it \"Ship_Txt.\" In the initial state of the cart, the subtotal will be less than ¥1,000, and the text needs to be displayed, so set the initial value to “true”.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/18.webp =300x) <em>A Boolean local variable is created with an initial value of true</em>\n</td>\n</tr></tbody>\n</table>\n<p>Next, I will explain the procedure for assigning the variables we have created. First, select the object on the canvas to which you want to assign a variable. Then, take a look at the “Layers” section in the panel on the right side of the screen and right-click the “eye” icon next to Passthrough (Transparency). This icon is not directly shown so it may be difficult to find. Right-clicking will reveal a drop-down menu with a list of variables that can be assigned. From there, select the variable we created earlier.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/19.webp =300x)</td>\n</tr></tbody>\n</table>\n<h3>Give an Action to the Button</h3>\n<p>We will also add action settings to set up conditional branching for show/hide text based on the subtotal amount.\nIf the subtotal amount is less than ¥1,000, text will be displayed (\"Ship_Txt\" = true), so add the text as shown below.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/20.webp =300x) <em>Description that changes the Boolean variable \"Ship_Txt\" to \"true\"</em>\n</td>\n</tr></tbody>\n</table>\n<p>On the other hand, if the subtotal is ¥1,000 or more, the text will be hidden (\"Ship_Txt\" = false), so add the following code. Please note that this is within the \"else\" statement.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/21.webp =300x) <em>Description that changes the Boolean variable \"Ship_Txt\" to \"false\"</em>\n</td>\n</tr></tbody>\n</table>\n<p>If you configure the settings for each button and run the preview, you will see how the text automatically hide when the subtotal reaches ¥1,000.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/22.webp =300x)</td>\n</tr></tbody>\n</table>\n<p>I was able to successfully hide the text.\nHowever, this leaves extra space, which isn’t ideal from a layout perspective. So I would like to try changing the text itself.</p>\n<h3>Modifying the text “free shipping” ver.2</h3>\n<h3>Create and Assign a Variable</h3>\n<p>Assuming there is or isn’t a shipping fee, we will set up the text to switch between the following two types:</p>\n<ul>\n<li>If the subtotal is less than ¥1,000: \"Only ¥X away from Free shipping!\"</li>\n<li>If the subtotal is ¥1,000 or more: “Free shipping!”\nI created a component for the free shipping text called \"Ship_Txt_Panel\" and created two variants. Since we want to toggle between them, we'll enter a Boolean value for each property.</li>\n</ul>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/23.webp =300x)</td>\n</tr></tbody>\n</table>\n<p>First, select the variant above and bring up the property change section in the panel on the right side of the screen. This variant is intended to be displayed initially, so set it to \"true\".</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody>\n<tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/24.webp =300x)</td>\n</tr>\n<tr>\n<td align=\"center\">Next, set the property of the variant below to false.</td>\n</tr>\n</tbody>\n</table>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/25.webp =300x)</td>\n</tr></tbody>\n</table>\n<p>Once you have set the properties, place the component instance in the design. While selecting the instance, check the right panel, and you will see a Boolean toggle switch in the Instances section.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/26.webp =300x) <em>Selecting an instance placed on the design</em>\n</td>\n</tr></tbody>\n</table>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/27.webp =300x) <em>The toggle switch on the right panel is set to true</em>\n</td>\n</tr></tbody>\n</table>\n<p>When you switch this toggle, the content of the instance will change, and you can confirm that the Boolean value has been set.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/28.webp =300x) <em>Switch the toggle on the right panel to false</em>\n</td>\n</tr></tbody>\n</table>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/29.webp =300x) <em>The content of the instance will be changed.</em>\n</td>\n</tr></tbody>\n</table>\n<p>Furthermore, if you hover the cursor over the toggle switch, an icon for assigning a variable will appear along with the float text. Click on it, and candidate variables will appear. Then, select the Boolean variable “Ship_Txt” from the list and assign it to the instance.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/30.webp =300x) <em>Click on the icon in the red box to display the candidate variables.</em>\n</td>\n</tr></tbody>\n</table>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/31.webp =300x) <em>The variable is assigned to the instance.</em>\n</td>\n</tr></tbody>\n</table>\n<h3>Give an Action to the Button</h3>\n<p>The button action description here is the same as the one which we set earlier to show/hide free shipping, so there is no need to modify it. If you preview it now, you can see that the text changes when the subtotal reaches ¥1,000.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/32.webp =300x)</td>\n</tr></tbody>\n</table>\n<p>Finally, we will set up the amount in the text to change according to the subtotal.</p>\n<h3>Create and Assign a Variable</h3>\n<p>Modify the text within the component, and separate the variable amount part from the rest of the text.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/33.webp =300x) <em>The variable amount part is highlighted</em>\n</td>\n</tr></tbody>\n</table>\n<p>Next, create a variable to assign to the variable part. Select \"Number\" as the data type and name it \"Extra_Fee\". The value of this variable represents the remaining amount needed to reach ¥1,000 for free shipping. Since the subtotal of the cart is ¥250, the difference is ¥1,000 - ¥250 = ¥750, so set the value of \"Extra_Fee\" to \"750.\"</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/34.webp =300x)</td>\n</tr></tbody>\n</table>\n<p>When you assign a variable to the number in the variable part, it will look like this:</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/35.webp =300x)</td>\n</tr></tbody>\n</table>\n<h3>Give an Action to the Button</h3>\n<p>To make this variable part change according to the increase or decrease in the subtotal, set it as follows. Note that if the subtotal is 1,000 or more, this text will change automatically, so no additional setting is needed.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/36.webp =300x)</td>\n</tr></tbody>\n</table>\n<h3>Completed</h3>\n<p>If you preview after setting up each button, you will see that the amount in the text changes when you press the plus (or minus) button, and that the text changes when the subtotal reaches ¥1,000.</p>\n<table>\n<thead><tr>\n<th align=\"center\"></th>\n</tr></thead>\n<tbody><tr>\n<td align=\"center\">![](/assets/blog/authors/aoshima/figma2/37.webp =300x)</td>\n</tr></tbody>\n</table>\n<p>This concludes the explanation of \"Let's create a shopping cart mockup using Figma's variable function!\"  The features introduced in this article can be applied in various situations, so I hope you find them useful.</p>\n"
    }
]